{
  "2025-08-24": [
    {
      "rownum": 102,
      "kw": "BUPATI DISMISSAL",
      "thm": "ANTI-CORRUPTION",
      "rx_kw": "The civil society coalition demands the dismissal of Bupati Sudewo over alleged corruption and erratic policies.",
      "rx_thm": "The protest directly targets alleged corruption within local governance, demanding accountability and action."
    },
    {
      "rownum": 104,
      "kw": "PALESTINE SOLIDARITY",
      "thm": "INTERNATIONAL PROTEST",
      "rx_kw": "Thousands gathered to express solidarity for Palestinian freedom and humanitarian support for Gaza.",
      "rx_thm": "The event is a large public demonstration in support of an international cause, reflecting Indonesian sentiment."
    },
    {
      "rownum": 127,
      "kw": "GAZA CONVOY",
      "thm": "HUMANITARIAN ADVOCACY",
      "rx_kw": "The Indonesia Global Peace Convoy was launched to strategize against the Gaza blockade and fight for a free Palestine.",
      "rx_thm": "The initiative is a humanitarian movement fostering regional solidarity and advocating for a free Palestine."
    }
  ],
  "2025-08-25": [
    {
      "rownum": 175,
      "kw": "KPK INVESTIGATION",
      "thm": "ANTI-CORRUPTION",
      "rx_kw": "The summary explicitly mentions KPK investigating extortion at the Ministry of Manpower.",
      "rx_thm": "The core activity described is an investigation into corrupt practices."
    },
    {
      "rownum": 185,
      "kw": "CORRUPTION PROTEST",
      "thm": "PUBLIC DEMONSTRATION",
      "rx_kw": "The summary details a public demonstration specifically against alleged corruption.",
      "rx_thm": "The main event is a public gathering to express grievances and demands."
    },
    {
      "rownum": 189,
      "kw": "PROTEST SECURITY",
      "thm": "PUBLIC ORDER",
      "rx_kw": "The summary highlights the deployment of personnel and police efforts to secure an upcoming demonstration.",
      "rx_thm": "The primary concern is maintaining peace and preventing disorder during a public gathering."
    },
    {
      "rownum": 199,
      "kw": "PLANNED PROTEST",
      "thm": "PUBLIC ALERT",
      "rx_kw": "The summary explicitly states a planned demonstration and a police warning to the public.",
      "rx_thm": "The police are issuing a warning to the public regarding potential unrest related to the planned event."
    },
    {
      "rownum": 200,
      "kw": "INTER-AGENCY INCIDENT",
      "thm": "INVESTIGATION",
      "rx_kw": "The summary describes an incident involving members of two different government agencies, TNI and Police.",
      "rx_thm": "Both police and TNI are actively investigating the reported incident."
    },
    {
      "rownum": 212,
      "kw": "INTER-AGENCY CLASH",
      "thm": "INVESTIGATION",
      "rx_kw": "The summary details an incident involving TNI members at a police station, stemming from a traffic accident.",
      "rx_thm": "Both police and TNI are actively investigating the reported incident, including alleged threats."
    },
    {
      "rownum": 230,
      "kw": "MINIMUM WAGE PROTEST",
      "thm": "LABOR RIGHTS",
      "rx_kw": "The summary explicitly states the demand for a minimum wage increase as the reason for the protests.",
      "rx_thm": "The protests are organized by labor organizations advocating for workers' rights, including wages."
    },
    {
      "rownum": 232,
      "kw": "FAN CLASH",
      "thm": "PUBLIC DISTURBANCE",
      "rx_kw": "The summary describes a violent confrontation between supporters of two football teams.",
      "rx_thm": "The incident caused injuries and damage, disrupting public peace and order."
    },
    {
      "rownum": 235,
      "kw": "DPR DISSOLUTION PROTEST",
      "thm": "POLITICAL UNREST",
      "rx_kw": "The summary clearly states the protest's demand for the dissolution of the DPR RI.",
      "rx_thm": "The protest reflects significant public anger and political dissatisfaction with the government body."
    },
    {
      "rownum": 239,
      "kw": "TRAFFIC DISRUPTION",
      "thm": "PROTEST IMPACT",
      "rx_kw": "The summary explicitly details severe traffic disruptions caused by the protest, affecting roads and public transport.",
      "rx_thm": "The protest had significant negative consequences on urban mobility and daily life."
    },
    {
      "rownum": 249,
      "kw": "FATALITY DENIAL",
      "thm": "POLICE RESPONSE",
      "rx_kw": "Polda DIY explicitly denied reports of fatalities following the unrest.",
      "rx_thm": "The police are actively managing information and maintaining security after the incident."
    },
    {
      "rownum": 252,
      "kw": "TRAFFIC DIVERSION",
      "thm": "PROTEST MANAGEMENT",
      "rx_kw": "The summary highlights police actions to reroute traffic and manage congestion caused by the demonstration.",
      "rx_thm": "Authorities are implementing measures to control the impact of the protest on urban infrastructure."
    },
    {
      "rownum": 254,
      "kw": "PROTEST DISPERSAL",
      "thm": "CROWD CONTROL",
      "rx_kw": "The summary explicitly states that police dispersed the DPR protest, pushing demonstrators.",
      "rx_thm": "Police are actively managing and controlling the crowd during the demonstration."
    },
    {
      "rownum": 255,
      "kw": "WATER CANNON DISPERSAL",
      "thm": "POLICE INTERVENTION",
      "rx_kw": "The summary explicitly mentions police using water cannons to disperse protesters.",
      "rx_thm": "Police are actively intervening to control and end the demonstration due to escalating behavior."
    },
    {
      "rownum": 263,
      "kw": "PROTEST VANDALISM",
      "thm": "ESCALATING UNREST",
      "rx_kw": "The summary describes protesters vandalizing structures and attempting to breach the building.",
      "rx_thm": "The demonstration is becoming increasingly violent and out of control, leading to public safety concerns."
    },
    {
      "rownum": 270,
      "kw": "ONGOING TRAFFIC BLOCK",
      "thm": "POST-PROTEST IMPACT",
      "rx_kw": "The summary highlights continued road closures and traffic blocks due to the ongoing demonstrations.",
      "rx_thm": "The aftermath of the protest continues to affect public order and urban infrastructure."
    },
    {
      "rownum": 277,
      "kw": "POLICE AID",
      "thm": "HUMANITARIAN GESTURE",
      "rx_kw": "The summary explicitly states that police distributed mineral water to demonstrators.",
      "rx_thm": "Police are showing a humanitarian side by providing aid to protesters amidst the ongoing situation."
    },
    {
      "rownum": 281,
      "kw": "VIOLENT CLASHES",
      "thm": "POLITICAL UNREST",
      "rx_kw": "The summary describes the demonstration as chaotic and violent, with objects thrown and water cannons used.",
      "rx_thm": "The protest is driven by public anger over political decisions, leading to escalating confrontation."
    },
    {
      "rownum": 284,
      "kw": "TAX HIKE PROTEST",
      "thm": "ECONOMIC GRIEVANCES",
      "rx_kw": "The summary clearly states the protest's demand for the cancellation of a Land and Building Tax increase.",
      "rx_thm": "The demonstration is fueled by public dissatisfaction with economic policies and living costs."
    },
    {
      "rownum": 285,
      "kw": "PUBLIC TRANSPORT DISRUPTION",
      "thm": "PROTEST IMPACT",
      "rx_kw": "The summary highlights the suspension and rerouting of TransJakarta bus routes due to the demonstration.",
      "rx_thm": "The protest is causing significant negative consequences for urban public transportation services."
    },
    {
      "rownum": 299,
      "kw": "TEAR GAS DISPERSAL",
      "thm": "CROWD CONTROL",
      "rx_kw": "The summary explicitly states that police fired tear gas to disperse students.",
      "rx_thm": "Police are using force to manage and break up a protesting crowd that is escalating the situation."
    },
    {
      "rownum": 303,
      "kw": "DPR DISSOLUTION PROTEST",
      "thm": "POLITICAL DISSATISFACTION",
      "rx_kw": "The summary clearly states the main demand of the protest is DPR dissolution.",
      "rx_thm": "The protest is driven by public anger and dissatisfaction with the political body and its allowances."
    },
    {
      "rownum": 305,
      "kw": "PROTEST VANDALISM",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The summary describes protesters vandalizing security posts and setting a motorcycle on fire.",
      "rx_thm": "The demonstration has escalated into chaotic and destructive behavior, indicating widespread public anger."
    },
    {
      "rownum": 306,
      "kw": "KPK INVESTIGATION",
      "thm": "ANTI-CORRUPTION",
      "rx_kw": "The summary states that KPK will investigate extortion at the Ministry of Manpower.",
      "rx_thm": "The core activity described is an investigation into corrupt practices within a government ministry."
    },
    {
      "rownum": 308,
      "kw": "PLANNED DPR PROTEST",
      "thm": "POLITICAL DISSATISFACTION",
      "rx_kw": "The summary details a planned protest with the specific demand for DPR dissolution.",
      "rx_thm": "The protest reflects public dissatisfaction with the political body and calls for its disbandment."
    },
    {
      "rownum": 313,
      "kw": "TOLL GATE FREE PASSAGE",
      "thm": "TRAFFIC MANAGEMENT",
      "rx_kw": "The summary highlights the granting of free passage at a toll gate to alleviate protest-induced traffic.",
      "rx_thm": "Authorities are implementing measures to manage and ease traffic congestion caused by the protest."
    },
    {
      "rownum": 316,
      "kw": "ECONOMIC HARDSHIP",
      "thm": "PUBLIC GRIEVANCES",
      "rx_kw": "The summary explicitly states the driver joined the protest due to a difficult economy and high prices.",
      "rx_thm": "The protest is fueled by widespread public dissatisfaction with economic conditions and government policies."
    },
    {
      "rownum": 318,
      "kw": "NATIONWIDE LABOR PROTEST",
      "thm": "WORKERS' RIGHTS",
      "rx_kw": "The summary details a plan for nationwide protests by labor unions across 38 provinces.",
      "rx_thm": "The protests are organized to advocate for various demands related to workers' welfare and rights."
    },
    {
      "rownum": 319,
      "kw": "NATIONWIDE LABOR PROTEST",
      "thm": "WORKERS' RIGHTS",
      "rx_kw": "The summary describes labor unions planning a larger nationwide demonstration with specific demands.",
      "rx_thm": "The planned protest aims to address various issues concerning workers' welfare and policy reforms."
    },
    {
      "rownum": 327,
      "kw": "VIOLENT STUDENT PROTEST",
      "thm": "URBAN UNREST",
      "rx_kw": "The summary describes a student protest that became violent, involving burning tires and throwing dangerous objects.",
      "rx_thm": "The protest has escalated into a chaotic and destructive situation within the city."
    },
    {
      "rownum": 331,
      "kw": "STUDENT REFUSAL",
      "thm": "PROTEST PERSISTENCE",
      "rx_kw": "The summary explicitly states that students continued to refuse dispersal by authorities.",
      "rx_thm": "The students are demonstrating continued resistance and determination in their protest."
    },
    {
      "rownum": 339,
      "kw": "ANARCHIC PROTEST",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The summary describes the protest as anarchic, involving damage and resulting in injuries.",
      "rx_thm": "The protest has escalated into a violent and disorderly situation in a specific region."
    },
    {
      "rownum": 344,
      "kw": "ANARCHIC CROWD DISPERSAL",
      "thm": "CROWD CONTROL",
      "rx_kw": "The summary details police using water cannons and tear gas to disperse an anarchic crowd.",
      "rx_thm": "Authorities are employing forceful methods to manage and break up a disorderly and violent protest."
    },
    {
      "rownum": 360,
      "kw": "POST-PROTEST UNREST",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "The summary describes clashes, damage, and arson occurring as the demonstration concluded.",
      "rx_thm": "The end of the protest was marked by continued public disorder and destructive acts."
    },
    {
      "rownum": 364,
      "kw": "POLICE FORCE",
      "thm": "CROWD CONTROL",
      "rx_kw": "The summary details police using tactical vehicles, water cannons, and tear gas against violent protesters.",
      "rx_thm": "Authorities are employing various forceful methods to manage and control a violent and resistant crowd."
    },
    {
      "rownum": 371,
      "kw": "APPEAL FOR ORDER",
      "thm": "PUBLIC ORDER",
      "rx_kw": "The summary states police urged protesters to remain orderly and avoid damaging public facilities.",
      "rx_thm": "Authorities are actively working to maintain peace and prevent destruction during the protest."
    },
    {
      "rownum": 373,
      "kw": "VIOLENT STUDENT PROTEST",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The summary describes a student protest that became chaotic, involving throwing objects and significant property damage.",
      "rx_thm": "The protest has escalated into a disorderly and destructive situation, indicating widespread public anger."
    },
    {
      "rownum": 379,
      "kw": "PUBLIC FACILITY DAMAGE",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The summary explicitly mentions the destruction of public facilities, including burning motorcycles and damaged fences.",
      "rx_thm": "The protest resulted in significant physical damage to public property and infrastructure."
    },
    {
      "rownum": 400,
      "kw": "TRAFFIC CONGESTION",
      "thm": "PROTEST IMPACT",
      "rx_kw": "The summary highlights severe traffic congestion and KRL delays caused by the protest.",
      "rx_thm": "The demonstration had significant negative consequences on urban mobility and daily commuting."
    },
    {
      "rownum": 401,
      "kw": "NIGHT CLASHES",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary describes demonstrations at night turning chaotic with clashes and vandalism of a police post.",
      "rx_thm": "The protest escalated into violent confrontations and destructive acts, particularly during the night."
    },
    {
      "rownum": 402,
      "kw": "STUDENT UNREST",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary describes students refusing to disperse, damaging a police post, and throwing dangerous objects.",
      "rx_thm": "The protest involved persistent and violent actions by students, leading to property damage and confrontation."
    },
    {
      "rownum": 404,
      "kw": "STUDENT-POLICE CLASHES",
      "thm": "URBAN CONFRONTATION",
      "rx_kw": "The summary details continued chaotic clashes between vocational students and police into the evening.",
      "rx_thm": "The situation involves prolonged and violent confrontations between protesters and law enforcement in an urban area."
    },
    {
      "rownum": 412,
      "kw": "SECURITY OVERSIGHT",
      "thm": "PROTEST MANAGEMENT",
      "rx_kw": "The summary mentions military and police chiefs inspecting the DPR protest, indicating high-level attention.",
      "rx_thm": "High-ranking officials are overseeing the management and response to the ongoing protest."
    },
    {
      "rownum": 417,
      "kw": "ALLOWANCE PROTEST",
      "thm": "POLITICAL UNREST",
      "rx_kw": "The summary states the protest was triggered by dissatisfaction over parliamentary allowances and turned violent.",
      "rx_thm": "The protest reflects public anger and political dissatisfaction with government policy regarding allowances."
    },
    {
      "rownum": 452,
      "kw": "VIOLENT DEMONSTRATIONS",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The summary describes violent demonstrations leading to clashes, arrests, and significant damage to property.",
      "rx_thm": "The protest resulted in widespread physical destruction and confrontation with authorities."
    },
    {
      "rownum": 453,
      "kw": "TOLL ROAD REOPENING",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary explicitly states the Gatot Subroto Toll Road reopened after the DPR riots.",
      "rx_thm": "The reopening signifies a return to normalcy and recovery efforts after the urban unrest."
    },
    {
      "rownum": 460,
      "kw": "RUINED POLICE POST",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The summary highlights a ruined police post as a direct result of the violent protest.",
      "rx_thm": "The protest involved significant physical destruction and damage to public property."
    }
  ],
  "2025-08-26": [
    {
      "rownum": 478,
      "kw": "POST-PROTEST ORDER",
      "thm": "PUBLIC ORDER",
      "rx_kw": "Summary focuses on the restoration of order and normal traffic flow after a demonstration.",
      "rx_thm": "The entry describes the return to normalcy and order following a period of disruption."
    },
    {
      "rownum": 491,
      "kw": "PROTEST CHAOS",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The summary highlights the chaotic end of a demonstration against DPR salary increases.",
      "rx_thm": "The entry describes a public demonstration that escalated into disorder and required police intervention."
    },
    {
      "rownum": 492,
      "kw": "BORDER DISPUTE",
      "thm": "TERRITORIAL CONFLICT",
      "rx_kw": "The summary directly details an incident involving a border dispute between two nations.",
      "rx_thm": "The entry describes a conflict arising from disputed land claims between countries."
    },
    {
      "rownum": 495,
      "kw": "PROTEST VANDALISM",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary details the destruction of a car by a mob during a protest.",
      "rx_thm": "The entry describes violent acts and damage to property occurring during a public demonstration."
    },
    {
      "rownum": 497,
      "kw": "GAZA CRISIS",
      "thm": "MIDDLE EAST CONFLICT",
      "rx_kw": "The summary focuses on Indonesia's call for action regarding the ongoing situation in Gaza.",
      "rx_thm": "The entry discusses diplomatic efforts related to the long-standing conflict in the Middle East."
    },
    {
      "rownum": 505,
      "kw": "DIPLOMATIC TENSIONS",
      "thm": "DIPLOMATIC CONFLICT",
      "rx_kw": "The summary explicitly mentions escalating international diplomatic tensions due to Israel denying entry to a mayor.",
      "rx_thm": "The entry describes a dispute between international entities, leading to strained diplomatic relations."
    },
    {
      "rownum": 529,
      "kw": "DISABLED PROTESTER",
      "thm": "PROTEST PARTICIPATION",
      "rx_kw": "The summary highlights a specific individual, a disabled person, who gained attention during a protest.",
      "rx_thm": "The entry focuses on the involvement of individuals in public demonstrations and their personal stories."
    },
    {
      "rownum": 530,
      "kw": "CHILD PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary focuses on the involvement of children in a demonstration and their subsequent examination.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 538,
      "kw": "CCTV VANDALISM",
      "thm": "PROTEST VANDALISM",
      "rx_kw": "The summary specifically mentions the vandalism of CCTV cameras during a demonstration.",
      "rx_thm": "The entry describes the destruction of public property that occurred during a protest."
    },
    {
      "rownum": 539,
      "kw": "TEACHER HARASSMENT",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary details a protest sparked by alleged sexual harassment committed by a teacher.",
      "rx_thm": "The entry focuses on safeguarding children from harm and ensuring their well-being, especially in educational environments."
    },
    {
      "rownum": 540,
      "kw": "CCTV VANDALISM",
      "thm": "PROTEST VANDALISM",
      "rx_kw": "The summary specifically mentions the vandalism of CCTV cameras during a chaotic protest.",
      "rx_thm": "The entry describes the destruction of public property that occurred during a protest."
    },
    {
      "rownum": 545,
      "kw": "TEACHER HARASSMENT",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary details the investigation into alleged sexual harassment by a teacher and related protests.",
      "rx_thm": "The entry focuses on safeguarding children from harm and ensuring their well-being, especially in educational environments."
    },
    {
      "rownum": 546,
      "kw": "DIVERSE NEWS",
      "thm": "CURRENT EVENTS",
      "rx_kw": "The summary explicitly states it covers diverse topics, including national and international events.",
      "rx_thm": "The entry provides a broad overview of various ongoing national and international developments."
    },
    {
      "rownum": 560,
      "kw": "CHILD PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary focuses on the arrest of children during a protest and demands for their release.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 562,
      "kw": "STUDENT PROTESTERS",
      "thm": "YOUTH INVOLVEMENT",
      "rx_kw": "The summary details parents picking up their children who were arrested for participating in a demonstration.",
      "rx_thm": "The entry highlights the participation of young individuals, specifically students, in public demonstrations."
    },
    {
      "rownum": 566,
      "kw": "PROTEST VANDALISM",
      "thm": "PUBLIC ORDER",
      "rx_kw": "The summary mentions regret over vandalism, including burning vehicles and damaging public facilities during a protest.",
      "rx_thm": "The entry discusses the maintenance of order during a protest and the condemnation of destructive acts."
    },
    {
      "rownum": 591,
      "kw": "PROTEST ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The summary details the securing and release of individuals arrested after a DPR riot.",
      "rx_thm": "The entry describes the actions taken by law enforcement in response to a public disturbance."
    },
    {
      "rownum": 604,
      "kw": "PROTEST ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The summary details the arrest of individuals, including students, following a riotous demonstration.",
      "rx_thm": "The entry describes the actions taken by law enforcement in response to a public disturbance."
    },
    {
      "rownum": 608,
      "kw": "PROTESTER APPREHENSION",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The summary describes police apprehending individuals suspected of protest-related damage and resistance.",
      "rx_thm": "The entry describes the actions taken by law enforcement in response to a public disturbance."
    },
    {
      "rownum": 609,
      "kw": "UNDERAGE PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary focuses on the release of underage students who were arrested during a protest.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 612,
      "kw": "PROTEST ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The summary details the arrest of numerous individuals for destructive actions during a protest.",
      "rx_thm": "The entry describes the actions taken by law enforcement in response to a public disturbance."
    },
    {
      "rownum": 617,
      "kw": "DIVERSE NEWS",
      "thm": "CURRENT EVENTS",
      "rx_kw": "The summary explicitly states it covers multiple national and international events.",
      "rx_thm": "The entry provides a broad overview of various ongoing national and international developments."
    },
    {
      "rownum": 629,
      "kw": "STUDENT PROTESTS",
      "thm": "YOUTH INVOLVEMENT",
      "rx_kw": "The summary focuses on students participating in demonstrations and the influence of social media.",
      "rx_thm": "The entry highlights the participation of young individuals, specifically students, in public demonstrations."
    },
    {
      "rownum": 633,
      "kw": "STUDENT PROTESTS",
      "thm": "YOUTH INVOLVEMENT",
      "rx_kw": "The summary details police warnings against inciting students to protest, highlighting their involvement and consequences.",
      "rx_thm": "The entry highlights the participation of young individuals, specifically students, in public demonstrations."
    },
    {
      "rownum": 645,
      "kw": "PROTESTER APPREHENSION",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The summary describes police apprehending individuals identified as vandals during a protest.",
      "rx_thm": "The entry describes the actions taken by law enforcement in response to a public disturbance."
    },
    {
      "rownum": 664,
      "kw": "CHILD PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary reports the apprehension of children by police during a chaotic protest.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 666,
      "kw": "STUDENT PROTESTERS",
      "thm": "YOUTH INVOLVEMENT",
      "rx_kw": "The summary details parents collecting their underage children who were arrested during a protest.",
      "rx_thm": "The entry highlights the participation of young individuals, specifically students, in public demonstrations."
    },
    {
      "rownum": 674,
      "kw": "ANARCHIC PROTEST",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The summary describes support for arrests made during an anarchic protest that damaged facilities.",
      "rx_thm": "The entry describes the actions taken by law enforcement in response to a public disturbance."
    },
    {
      "rownum": 679,
      "kw": "JOURNALIST PROTECTION",
      "thm": "PRESS FREEDOM",
      "rx_kw": "The summary details an order for police to protect journalists, especially during demonstrations.",
      "rx_thm": "The entry discusses the importance of safeguarding the media's ability to report freely and safely."
    },
    {
      "rownum": 681,
      "kw": "PROTEST RIOT",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The summary describes a protest that turned chaotic and ended in a riot with police being pelted.",
      "rx_thm": "The entry describes a public demonstration that escalated into disorder and required police intervention."
    },
    {
      "rownum": 690,
      "kw": "PROTEST VANDALISM",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary details an official car being attacked and damaged by a protest crowd.",
      "rx_thm": "The entry describes violent acts and damage to property occurring during a public demonstration."
    },
    {
      "rownum": 694,
      "kw": "PROTEST AFTERMATH",
      "thm": "PUBLIC ORDER",
      "rx_kw": "The summary describes the damage and subsequent cleanup operations after a demonstration.",
      "rx_thm": "The entry describes the return to normalcy and order following a period of disruption."
    },
    {
      "rownum": 701,
      "kw": "CHAOTIC PROTEST",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The summary describes a protest that turned chaotic, involving clashes and property damage.",
      "rx_thm": "The entry describes a public demonstration that escalated into disorder and required police intervention."
    },
    {
      "rownum": 716,
      "kw": "MINOR PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary details the repatriation of minors arrested during a demonstration, highlighting their involvement.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 724,
      "kw": "GOVERNMENT STANCE",
      "thm": "PUBLIC ORDER",
      "rx_kw": "The summary outlines the government's position on the right to demonstrate versus condemning destructive behavior.",
      "rx_thm": "The entry describes the return to normalcy and order following a period of disruption."
    },
    {
      "rownum": 746,
      "kw": "STUDENT PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary discusses the handling of underage student protesters by police and KPAI's assessment.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 751,
      "kw": "PROTEST AFTERMATH",
      "thm": "PUBLIC ORDER",
      "rx_kw": "The summary describes the damage and subsequent cleanup operations after a chaotic protest.",
      "rx_thm": "The entry describes the return to normalcy and order following a period of disruption."
    },
    {
      "rownum": 756,
      "kw": "UNDERAGE PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary details the release of underage students arrested during a disruptive demonstration.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    },
    {
      "rownum": 759,
      "kw": "STUDENT PROTESTERS",
      "thm": "CHILD PROTECTION",
      "rx_kw": "The summary focuses on KPAI's urging against expelling students arrested for protest-related damage.",
      "rx_thm": "The entry discusses efforts to safeguard the rights and welfare of minors participating in public protests."
    }
  ],
  "2025-08-27": [
    {
      "rownum": 770,
      "kw": "VIOLENT PROTEST",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "The summary details a demonstration that escalated to violence, vandalism, and clashes.",
      "rx_thm": "The entry describes a public gathering that resulted in widespread chaos, property damage, and arrests."
    },
    {
      "rownum": 771,
      "kw": "PROPERTY DAMAGE",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "A car was specifically targeted and damaged by a mob during a DPR RI demonstration.",
      "rx_thm": "The incident highlights the destructive and violent nature of the demonstration."
    },
    {
      "rownum": 773,
      "kw": "COMBATING DISINFORMATION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The government plans to collaborate with social media platforms to combat disinformation and hate speech.",
      "rx_thm": "The government is taking action to address the causes and consequences of protest-related unrest."
    },
    {
      "rownum": 777,
      "kw": "POLICE HANDLING",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Komisi III DPR praised the police for their effective management of the demonstration.",
      "rx_thm": "The entry focuses on the actions and effectiveness of law enforcement in managing public protests."
    },
    {
      "rownum": 778,
      "kw": "DPR PROTEST",
      "thm": "NATIONAL ISSUES",
      "rx_kw": "A riot erupted during a demonstration at the DPR/MPR building, protesting high council member allowances.",
      "rx_thm": "The summary covers multiple significant problems affecting the nation, including corruption, murder, and public unrest."
    },
    {
      "rownum": 803,
      "kw": "SOCIAL MEDIA INCITEMENT",
      "thm": "DIGITAL REGULATION",
      "rx_kw": "Komdigi will summon social media platforms over provocative content inciting riots.",
      "rx_thm": "The government is addressing the role of digital platforms in instigating public disorder and violence."
    },
    {
      "rownum": 826,
      "kw": "VEHICLE VANDALISM",
      "thm": "POST-PROTEST VIOLENCE",
      "rx_kw": "An official car was attacked and severely damaged by a crowd of dispersed protesters.",
      "rx_thm": "The incident describes continued acts of destruction and violence after a protest had officially ended."
    },
    {
      "rownum": 840,
      "kw": "TREASON RIOT",
      "thm": "PUBLIC UNREST",
      "rx_kw": "Sympathizers of treason defendants rioted, causing chaos and property damage to government offices.",
      "rx_thm": "The summary details a situation of widespread public disturbance and destruction."
    },
    {
      "rownum": 842,
      "kw": "HUMANE HANDLING",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Deputy Speaker praised TNI-Polri for their calm and measured response to the unrest.",
      "rx_thm": "The entry highlights the professional and restrained behavior of law enforcement during a volatile situation."
    },
    {
      "rownum": 853,
      "kw": "NATIONAL UNITY",
      "thm": "PREVENTING UNREST",
      "rx_kw": "President Prabowo urged national unity and caution against misinformation to prevent unrest.",
      "rx_thm": "The president's message focuses on strategies to avoid public disorder and violence."
    },
    {
      "rownum": 858,
      "kw": "DIVERSE NEWS",
      "thm": "MULTIPLE EVENTS",
      "rx_kw": "The summary covers a wide range of unrelated global and national events.",
      "rx_thm": "The entry presents a collection of various distinct occurrences and issues."
    },
    {
      "rownum": 873,
      "kw": "PROTEST INJURIES",
      "thm": "AFTERMATH OF VIOLENCE",
      "rx_kw": "Several police officers and a civilian were hospitalized after a violent demonstration.",
      "rx_thm": "The entry describes the consequences and impact of a violent public gathering."
    },
    {
      "rownum": 907,
      "kw": "MULTI-TOPIC NEWS",
      "thm": "DIVERSE REPORTING",
      "rx_kw": "The summary presents a collection of various unrelated national and international news items.",
      "rx_thm": "The entry covers a broad spectrum of different events and issues without a single focus."
    },
    {
      "rownum": 908,
      "kw": "LABOR PROTESTS",
      "thm": "WORKERS' RIGHTS",
      "rx_kw": "Thousands of personnel are deployed to guard nationwide labor protests demanding wage increases.",
      "rx_thm": "The core issue revolves around workers advocating for better conditions and fair treatment."
    },
    {
      "rownum": 931,
      "kw": "HOUSE EXECUTION CHAOS",
      "thm": "RESISTANCE TO AUTHORITY",
      "rx_kw": "Residents obstructed a house execution, injuring one police officer and leading to four arrests.",
      "rx_thm": "The entry describes public opposition and violent acts against a legal process."
    },
    {
      "rownum": 958,
      "kw": "PROTEST CASUALTIES",
      "thm": "VIOLENT OUTCOME",
      "rx_kw": "Nine victims, including police, were injured during a violent DPR protest, with one officer needing surgery.",
      "rx_thm": "The summary highlights the severe physical harm and arrests resulting from the demonstration."
    },
    {
      "rownum": 961,
      "kw": "TIKTOK MONITORING",
      "thm": "PREVENTING UNREST",
      "rx_kw": "Police are monitoring TikTok live streams for content inciting students to join an upcoming labor demonstration.",
      "rx_thm": "Law enforcement is taking proactive measures to prevent public disorder and criminal acts."
    },
    {
      "rownum": 978,
      "kw": "INJURED OFFICERS",
      "thm": "POLICE WELFARE",
      "rx_kw": "Wakapolri visited police officers and a civilian injured during a DPR demonstration.",
      "rx_thm": "The visit emphasizes the support and care provided to law enforcement personnel injured in the line of duty."
    },
    {
      "rownum": 983,
      "kw": "SORONG ARRESTS",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Police arrested 10 sympathizers in Sorong for destroying property and clashing with officers.",
      "rx_thm": "The entry describes a situation of chaos, property damage, and confrontation with law enforcement."
    },
    {
      "rownum": 985,
      "kw": "MINORS INCITED",
      "thm": "SOCIAL MEDIA IMPACT",
      "rx_kw": "196 minors were arrested, incited by social media to participate in a violent protest.",
      "rx_thm": "The summary highlights the significant role of social media in mobilizing and influencing participants, especially minors, in violent demonstrations."
    },
    {
      "rownum": 996,
      "kw": "VARIED NEWS",
      "thm": "COMPREHENSIVE REPORTING",
      "rx_kw": "The summary covers a wide array of national and international events and issues.",
      "rx_thm": "The entry provides a broad overview of different current affairs without a single dominant theme."
    },
    {
      "rownum": 1009,
      "kw": "BORDER DISPUTE",
      "thm": "INTERNATIONAL RELATIONS",
      "rx_kw": "Indonesia seeks clarification from Timor Leste regarding a border incident where a resident was reportedly shot.",
      "rx_thm": "The incident involves a disagreement and potential conflict between two sovereign nations."
    },
    {
      "rownum": 1013,
      "kw": "PROTEST ARRESTS",
      "thm": "PUBLIC DISCONTENT",
      "rx_kw": "Police arrested 39 demonstrators after a protest escalated with attempts to breach the DPRD building.",
      "rx_thm": "The arrests reflect the authorities' response to public dissatisfaction and escalating protest actions."
    },
    {
      "rownum": 1029,
      "kw": "POLICE BRUTALITY",
      "thm": "LAW ENFORCEMENT MISCONDUCT",
      "rx_kw": "An officer critically injured a student by throwing a helmet during a street racing dispersal.",
      "rx_thm": "The incident involves allegations of excessive force and improper conduct by a police officer."
    },
    {
      "rownum": 1032,
      "kw": "JOURNALIST OBSTRUCTION",
      "thm": "PRESS FREEDOM",
      "rx_kw": "KKJ condemned alleged police violence and obstruction against journalists covering a Medan protest.",
      "rx_thm": "The entry highlights concerns about the ability of the press to report freely without interference or harm."
    }
  ],
  "2025-08-28": [
    {
      "rownum": 1071,
      "kw": "LABOR PROTEST",
      "thm": "PUBLIC DEMONSTRATIONS",
      "rx_kw": "The summary explicitly states 'Thousands of labor protesters gathered' and lists their demands.",
      "rx_thm": "The entry describes a large-scale public gathering to express grievances and demands."
    },
    {
      "rownum": 1086,
      "kw": "PUBLIC ORDER",
      "thm": "SECURITY MEASURES",
      "rx_kw": "The summary focuses on police actions to prevent disorder and ensure compliance with regulations.",
      "rx_thm": "The entry details specific actions taken by authorities to maintain safety and enforce rules."
    },
    {
      "rownum": 1088,
      "kw": "STUDENT APPREHENSION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Police apprehended students carrying weapons who intended to join a rally.",
      "rx_thm": "The core action is preventing potentially violent individuals from joining a demonstration."
    },
    {
      "rownum": 1089,
      "kw": "STUDENT INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Police intercepted numerous students, many minors, to prevent their involvement in protests.",
      "rx_thm": "The entry highlights efforts by authorities to stop students from participating in demonstrations."
    },
    {
      "rownum": 1092,
      "kw": "TRAFFIC DIVERSIONS",
      "thm": "PROTEST IMPACT",
      "rx_kw": "The summary details extensive traffic diversions implemented due to a labor protest.",
      "rx_thm": "The entry focuses on the disruption caused by the protest to urban mobility and infrastructure."
    },
    {
      "rownum": 1099,
      "kw": "TRAFFIC MANAGEMENT",
      "thm": "PROTEST IMPACT",
      "rx_kw": "Polda Metro Jaya implemented specific rerouting points for vehicles and TransJakarta buses due to a protest.",
      "rx_thm": "The entry describes the measures taken to control traffic flow during a public demonstration."
    },
    {
      "rownum": 1109,
      "kw": "HUMANE POLICING",
      "thm": "POLICE CONDUCT",
      "rx_kw": "LBH Jakarta urged police to avoid using weapons and adhere to human rights during protests.",
      "rx_thm": "The entry emphasizes the importance of ethical and rights-respecting behavior by law enforcement during demonstrations."
    },
    {
      "rownum": 1113,
      "kw": "HUMANE APPROACH",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Kapolda Metro Jaya instructed personnel to use a humane approach and avoid firearms during a demonstration.",
      "rx_thm": "The entry highlights official directives for police to handle protests with restraint and prioritize safety."
    },
    {
      "rownum": 1114,
      "kw": "STUDENT INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Police apprehended students at stations, finding items indicating potential for violence at a rally.",
      "rx_thm": "The entry focuses on preventing students from joining protests with potentially violent intentions."
    },
    {
      "rownum": 1115,
      "kw": "CORRUPTION JUSTICE",
      "thm": "PUBLIC DEMANDS",
      "rx_kw": "Pati residents plan a demonstration demanding further action in a KPK bribery case.",
      "rx_thm": "The entry describes public calls for accountability and legal action against alleged corruption."
    },
    {
      "rownum": 1116,
      "kw": "STUDENT INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Police intercepted students, some with bows and arrows, attempting to join a demonstration.",
      "rx_thm": "The entry focuses on preventing potentially armed students from participating in protests."
    },
    {
      "rownum": 1118,
      "kw": "PROTEST DAMAGE REPAIR",
      "thm": "POST-PROTEST ACTIONS",
      "rx_kw": "The DKI Jakarta government announced repairs to public facilities damaged during a demonstration.",
      "rx_thm": "The entry describes the government's response to restore public infrastructure after protest-related damage."
    },
    {
      "rownum": 1121,
      "kw": "TRAFFIC DIVERSIONS",
      "thm": "PROTEST IMPACT",
      "rx_kw": "Polda Metro Jaya implemented traffic diversions due to increasing crowds at a labor demonstration.",
      "rx_thm": "The entry focuses on the disruption caused by the protest to urban mobility and infrastructure."
    },
    {
      "rownum": 1126,
      "kw": "PROTEST SECURITY",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polda Metro Jaya deployed nearly 5,000 joint personnel to secure an upcoming labor demonstration.",
      "rx_thm": "The entry details the extensive deployment of forces to ensure safety and order during a public gathering."
    },
    {
      "rownum": 1128,
      "kw": "STUDENT WARNINGS",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Bogor Police are visiting schools, urging students to avoid brawls and unproductive demonstrations.",
      "rx_thm": "The entry highlights efforts to educate and deter students from engaging in disruptive public activities."
    },
    {
      "rownum": 1136,
      "kw": "PROTEST MANAGEMENT",
      "thm": "PUBLIC ORDER",
      "rx_kw": "Polda Metro Jaya reminded labor protestors of time limits and emphasized a humane approach to ensure public order.",
      "rx_thm": "The entry describes police efforts to control and facilitate demonstrations while maintaining peace."
    },
    {
      "rownum": 1142,
      "kw": "PEACEFUL RALLY",
      "thm": "PUBLIC DEMONSTRATIONS",
      "rx_kw": "A labor union rally at the DPR building was conducted orderly and concluded peacefully.",
      "rx_thm": "The entry describes a public gathering where demands were presented without violence or major disruption."
    },
    {
      "rownum": 1146,
      "kw": "TRAFFIC DIVERSIONS",
      "thm": "PROTEST IMPACT",
      "rx_kw": "Polda Metro Jaya implemented traffic diversions in Central Jakarta due to a labor demonstration.",
      "rx_thm": "The entry focuses on the disruption caused by the protest to urban mobility and infrastructure."
    },
    {
      "rownum": 1149,
      "kw": "STUDENT DEMANDS",
      "thm": "GOVERNANCE ACCOUNTABILITY",
      "rx_kw": "Student protesters demanded changes regarding the performance and salaries of DPR members.",
      "rx_thm": "The entry highlights public calls for improved government performance and financial transparency."
    },
    {
      "rownum": 1151,
      "kw": "LABOR REFORMS",
      "thm": "PUBLIC DEMANDS",
      "rx_kw": "Thousands of laborers protested demanding labor reforms, asset forfeiture, and election law revision.",
      "rx_thm": "The entry describes public calls for changes in labor policies and broader legislative issues."
    },
    {
      "rownum": 1163,
      "kw": "VIOLENT PROTEST",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A student and mass protest escalated into chaos, with objects thrown and police using water cannons and tear gas.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1164,
      "kw": "PROTEST CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A DPR demonstration escalated into chaos, with police deploying water cannons and tear gas against protesters.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1169,
      "kw": "STUDENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Hundreds of students protested at the DPR/MPR building, clashing with security forces.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1177,
      "kw": "VIOLENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A violent demonstration saw protesters throw Molotov cocktails, firecrackers, and stones at police.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1180,
      "kw": "PROTESTER RESISTANCE",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Protesters dispersed from the DPR gate continued to resist, burning banners and water barriers.",
      "rx_thm": "The entry describes ongoing unruly behavior and defiance by demonstrators after initial dispersal."
    },
    {
      "rownum": 1184,
      "kw": "VIOLENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Protesters breached railway tracks, throwing stones and Molotov cocktails at police, who responded with tear gas.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1187,
      "kw": "STUDENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A student protest near Bogor Palace escalated into shoving matches and bottle-throwing at police.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1189,
      "kw": "PROTESTER RESISTANCE",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Student protesters resisted police, throwing rocks, bottles, and firecrackers, leading to water cannon deployment.",
      "rx_thm": "The entry describes ongoing unruly behavior and defiance by demonstrators after initial dispersal."
    },
    {
      "rownum": 1191,
      "kw": "STUDENT INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Bogor City Police prevented 150 students from joining a DPR demonstration in Jakarta.",
      "rx_thm": "The entry focuses on preventing students from participating in potentially disruptive public activities."
    },
    {
      "rownum": 1196,
      "kw": "PEACEFUL PROTEST",
      "thm": "PUBLIC DEMONSTRATIONS",
      "rx_kw": "A student protest near Bogor Palace concluded peacefully, with demonstrators dispersing after presenting demands.",
      "rx_thm": "The entry describes a public gathering where demands were presented without violence or major disruption."
    },
    {
      "rownum": 1199,
      "kw": "LABOR WAGES",
      "thm": "ECONOMIC DEMANDS",
      "rx_kw": "Hundreds of laborers protested against increasing DPR member income and low wages, demanding an 8.5% increase.",
      "rx_thm": "The entry highlights public calls for fair compensation and improved economic conditions for workers."
    },
    {
      "rownum": 1202,
      "kw": "PEACEFUL PROTEST",
      "thm": "PUBLIC DEMONSTRATIONS",
      "rx_kw": "Labor unions held a peaceful demonstration at the Central Java Governor's Office in Semarang.",
      "rx_thm": "The entry describes a public gathering where demands were presented without violence or major disruption."
    },
    {
      "rownum": 1203,
      "kw": "ANTI-CORRUPTION PROTEST",
      "thm": "PUBLIC DEMANDS",
      "rx_kw": "Laborers protested alleged K3 certificate corruption involving a former Deputy Minister.",
      "rx_thm": "The entry describes public calls for accountability and legal action against alleged corruption."
    },
    {
      "rownum": 1204,
      "kw": "PROTEST RIOTS",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Student and public demonstrations at the DPR/MPR building escalated into riots, attributed to infiltrators.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1205,
      "kw": "HUMANE PROTEST HANDLING",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Kapolda Metro Jaya instructed personnel to handle DPR labor demonstrations humanely, prioritizing persuasion.",
      "rx_thm": "The entry highlights official directives for police to handle protests with restraint and prioritize safety."
    },
    {
      "rownum": 1207,
      "kw": "LABOR WELFARE",
      "thm": "GOVERNMENT POLICY",
      "rx_kw": "President Prabowo approved the Labor Welfare Council and Termination of Employment Task Force.",
      "rx_thm": "The entry describes government initiatives aimed at addressing worker issues and improving labor laws."
    },
    {
      "rownum": 1208,
      "kw": "LABOR WAGES",
      "thm": "ECONOMIC DEMANDS",
      "rx_kw": "Thousands of laborers protested in Surabaya, demanding an end to outsourcing and higher wages.",
      "rx_thm": "The entry highlights public calls for fair compensation and improved economic conditions for workers."
    },
    {
      "rownum": 1211,
      "kw": "PROTEST RIOTS",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Police reported infiltrators caused a riot during a labor and student demonstration at the DPR/MPR building.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1212,
      "kw": "PROTEST SECURITY",
      "thm": "PUBLIC ORDER",
      "rx_kw": "Jakarta police are ensuring public safety as protests disperse, with heavy patrols and appeals for calm.",
      "rx_thm": "The entry describes police efforts to maintain peace and order during and after public demonstrations."
    },
    {
      "rownum": 1213,
      "kw": "WAGE DISPARITY",
      "thm": "ECONOMIC DEMANDS",
      "rx_kw": "Thousands of laborers protested high DPR salaries and demanded fair wage increases.",
      "rx_thm": "The entry highlights public calls for fair compensation and improved economic conditions for workers."
    },
    {
      "rownum": 1215,
      "kw": "HUMANE POLICING",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Polda Metro Jaya personnel distributed water and bread to labor protesters, demonstrating a humane approach.",
      "rx_thm": "The entry highlights police actions that show restraint and concern for the well-being of protesters."
    },
    {
      "rownum": 1218,
      "kw": "STUDENT SAFETY",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Jakarta Governor instructed schools to strictly prevent students from participating in demonstrations.",
      "rx_thm": "The entry highlights efforts to protect students from potential harm during public demonstrations."
    },
    {
      "rownum": 1223,
      "kw": "STUDENT INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Police intercepted students from various regions heading to a DPR protest; one carried nine arrows.",
      "rx_thm": "The entry focuses on preventing students from participating in potentially disruptive public activities."
    },
    {
      "rownum": 1224,
      "kw": "WAGE INCREASE",
      "thm": "ECONOMIC DEMANDS",
      "rx_kw": "Thousands of laborers protested nationwide, demanding an 8.5-10.5% wage increase.",
      "rx_thm": "The entry highlights public calls for fair compensation and improved economic conditions for workers."
    },
    {
      "rownum": 1226,
      "kw": "MULTIPLE PROTESTS",
      "thm": "NATIONAL UNREST",
      "rx_kw": "Student protests turned violent, alongside ongoing corruption cases and labor union protests.",
      "rx_thm": "The entry describes a confluence of various public demonstrations and societal issues occurring simultaneously."
    },
    {
      "rownum": 1228,
      "kw": "STUDENT MOBILIZATION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "KPAI urged police to investigate those mobilizing schoolchildren for Parliament protests.",
      "rx_thm": "The entry highlights concerns and actions taken to prevent the exploitation of minors in demonstrations."
    },
    {
      "rownum": 1232,
      "kw": "ANARCHIC PROTESTS",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Mass protests at the DPR/MPR building turned chaotic and anarchic, with objects thrown and fires set.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1238,
      "kw": "CRIME DURING PROTEST",
      "thm": "PUBLIC ORDER",
      "rx_kw": "A pickpocket was apprehended during a labor demonstration at the DPR building.",
      "rx_thm": "The entry describes an instance of criminal activity occurring amidst a public gathering."
    },
    {
      "rownum": 1242,
      "kw": "PROTEST FATALITY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "An online motorcycle taxi driver was fatally run over by a Brimob armored vehicle during a protest dispersal.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    },
    {
      "rownum": 1244,
      "kw": "PROTEST FATALITY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "A motorcycle taxi driver was fatally run over by a Brimob Barracuda armored vehicle during a DPR protest.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    },
    {
      "rownum": 1246,
      "kw": "ANTI-CORRUPTION DEMAND",
      "thm": "PUBLIC DEMANDS",
      "rx_kw": "A Pati civil society coalition plans to protest at the KPK, demanding Regent Sudewo be named a suspect.",
      "rx_thm": "The entry describes public calls for accountability and legal action against alleged corruption."
    },
    {
      "rownum": 1247,
      "kw": "ECONOMIC INEQUALITY",
      "thm": "LABOR RIGHTS",
      "rx_kw": "Labor Party President criticized DPR members' lavish lifestyles, contrasting it with workers' struggles.",
      "rx_thm": "The entry highlights public grievances regarding disparities in wealth and living standards."
    },
    {
      "rownum": 1250,
      "kw": "ANARCHIC PROTESTS",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A chaotic demonstration saw protesters block the Inner City Toll Road, burning tires and throwing bottles.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1252,
      "kw": "PROTEST DISRUPTION",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Unknown individuals caused anarchic acts during a DPR/MPR/DPD protest, disrupting public facilities and toll roads.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1253,
      "kw": "PROTEST CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A protest at the DPR building escalated as demonstrators threw firecrackers, bottles, and wood.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and police intervention."
    },
    {
      "rownum": 1254,
      "kw": "STUDENT MOBILIZATION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Three WhatsApp group administrators were apprehended for mobilizing 197 Bogor students to a DPR demonstration.",
      "rx_thm": "The entry highlights concerns and actions taken to prevent the exploitation of minors in demonstrations."
    },
    {
      "rownum": 1257,
      "kw": "VIOLENT STUDENT PROTEST",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "A student protest at the DPR/MPR building turned violent, blocking the toll road and burning tires.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1258,
      "kw": "PROTEST FATALITY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "An online motorcycle taxi driver was fatally run over by a speeding Brimob armored vehicle during a DPR riot.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    },
    {
      "rownum": 1259,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief Listyo Sigit Prabowo apologized for the death of an ojol driver.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1260,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief Listyo Sigit Prabowo apologized for an ojol driver's death by a Brimob tactical vehicle.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1262,
      "kw": "PROTEST AFTERMATH",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Police dispersed DPR protesters, leaving behind trash, debris, and damaged public facilities.",
      "rx_thm": "The entry describes the consequences and cleanup efforts following a disruptive public demonstration."
    },
    {
      "rownum": 1264,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Kapolri Sigit Prabowo apologized for a fatal incident where a Brimob tactical vehicle ran over an ojol driver.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1265,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief Listyo Sigit Prabowo apologized for a Brimob tactical vehicle fatally running over an ojol driver.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1266,
      "kw": "DETAINED CHILDREN",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Polda Metro Jaya ensures detained children from the DPR/MPR protest receive social and medical assistance.",
      "rx_thm": "The entry highlights police efforts to provide care and adhere to protocols for minors involved in protests."
    },
    {
      "rownum": 1273,
      "kw": "TOLL ROAD CLOSURE",
      "thm": "PROTEST IMPACT",
      "rx_kw": "The Jakarta Inner City Toll Road was empty due to police closing and diverting traffic in anticipation of demonstrations.",
      "rx_thm": "The entry focuses on the disruption caused by the protest to urban mobility and infrastructure."
    },
    {
      "rownum": 1276,
      "kw": "POLICE INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief ordered Propam Polri to investigate the fatal incident where an ojol driver was hit by a Brimob Barracuda.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1277,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief Listyo Sigit Prabowo apologized for a Brimob vehicle fatally running over an ojol driver.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1280,
      "kw": "STUDENT INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Police intercepted hundreds of students en route to a DPR demonstration, finding arrows and bottles.",
      "rx_thm": "The entry focuses on preventing students from participating in potentially disruptive public activities."
    },
    {
      "rownum": 1283,
      "kw": "STUDENT DEMANDS",
      "thm": "NATIONAL REFORM",
      "rx_kw": "Students protested against corruption, injustice, and various government policies near Bogor Palace.",
      "rx_thm": "The entry highlights public calls for significant changes in governance and societal issues."
    },
    {
      "rownum": 1284,
      "kw": "VIOLENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "DPR/MPR demonstrations turned chaotic, with protesters throwing stones, firecrackers, and Molotov cocktails.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1287,
      "kw": "PROTEST FATALITY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Ojol driver Affan Kurniawan was killed by a Brimob tactical vehicle while it dispersed a protest crowd.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    },
    {
      "rownum": 1290,
      "kw": "POLICE ACCOUNTABILITY",
      "thm": "JUSTICE SYSTEM",
      "rx_kw": "Kapolda Metro Jaya vowed firm, transparent action against Brimob members involved in the fatal running over of an ojol driver.",
      "rx_thm": "The entry highlights official commitment to investigate and address alleged misconduct by law enforcement."
    },
    {
      "rownum": 1291,
      "kw": "TRANSPARENT INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Inspector General Abdul Karim assured a transparent and swift investigation into the ojol driver incident.",
      "rx_thm": "The entry highlights official commitment to investigate and address alleged misconduct by law enforcement."
    },
    {
      "rownum": 1293,
      "kw": "PUBLIC OUTRAGE",
      "thm": "PROTEST AFTERMATH",
      "rx_kw": "The Presidential Palace urged calm as BEMs plan protests following the fatal hit-and-run of an ojol driver.",
      "rx_thm": "The entry describes the public's strong negative reaction and subsequent actions following a controversial incident."
    },
    {
      "rownum": 1294,
      "kw": "EXTERNAL OVERSIGHT",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Kompolnas urged Polda Metro Jaya to identify the Brimob armored vehicle driver who hit an ojol driver.",
      "rx_thm": "The entry highlights the role of independent bodies in monitoring and ensuring police adherence to law."
    },
    {
      "rownum": 1298,
      "kw": "WEAPONS INTERCEPTION",
      "thm": "PROTEST PREVENTION",
      "rx_kw": "Two young men were apprehended for carrying Molotov cocktails intended for a DPR protest.",
      "rx_thm": "The entry focuses on preventing individuals from bringing dangerous items to public demonstrations."
    },
    {
      "rownum": 1299,
      "kw": "POLICE INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Seven Brimob members are under investigation for fatally hitting an ojol driver during a protest.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1300,
      "kw": "POLICE INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Propam Mabes Polri is investigating a Brimob officer for fatally running over an ojol driver during DPR protests.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1301,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Jakarta Police Chief Karyoto apologized for a Brimob tactical vehicle fatally striking an ojol driver.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1303,
      "kw": "JUSTICE SEEKING",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The Presidential Palace urged calm as the family of an ojol driver killed by a Brimob Barracuda seeks justice.",
      "rx_thm": "The entry highlights public and family demands for fair legal processes and consequences for alleged misconduct."
    },
    {
      "rownum": 1304,
      "kw": "POLICE INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Seven Brimob Polda Metro Jaya members are under investigation for fatally running over an ojol driver.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1305,
      "kw": "HUMANE SECURITY",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Kapolda Metro Jaya urged humane protest security and offered condolences for the ojol driver killed.",
      "rx_thm": "The entry highlights police efforts to maintain peace and order while showing empathy and restraint."
    },
    {
      "rownum": 1307,
      "kw": "VIOLENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Jakarta protests escalated into violent clashes, with demonstrators throwing firecrackers, rocks, and Molotov cocktails.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1308,
      "kw": "POLICE ACCOUNTABILITY",
      "thm": "VICTIM SUPPORT",
      "rx_kw": "Kapolda Metro Jaya pledged to cover all funeral costs for an ojol driver fatally hit by a Brimob vehicle.",
      "rx_thm": "The entry highlights official actions to provide assistance and acknowledge responsibility to victims of incidents."
    },
    {
      "rownum": 1309,
      "kw": "PROTEST CASUALTIES",
      "thm": "PROTEST AFTERMATH",
      "rx_kw": "One police officer is critical and 10 injured securing Jakarta protests, and an ojol driver died.",
      "rx_thm": "The entry describes the human cost and injuries resulting from public demonstrations."
    },
    {
      "rownum": 1313,
      "kw": "POLICE INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Seven Brimob personnel are under Propam Polri investigation for allegedly running over and killing an ojol driver.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1316,
      "kw": "INTERNAL INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Propam Polri is examining seven Satbrimob Polda Metro Jaya members involved in a tactical vehicle hitting an ojol driver.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1317,
      "kw": "VIOLENT CLASHES",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Violent clashes erupted between protesters and police at GBK Arena, with attacks and arrests.",
      "rx_thm": "The entry describes a public gathering that turned unruly, involving clashes and destructive acts."
    },
    {
      "rownum": 1320,
      "kw": "TRANSPARENT INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Propam Polri Head assured a swift, transparent investigation into a Brimob tactical vehicle fatally hitting an ojol driver.",
      "rx_thm": "The entry highlights official commitment to investigate and address alleged misconduct by law enforcement."
    },
    {
      "rownum": 1323,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Kapolda Metro Jaya apologized for a Brimob tactical vehicle fatally running over ojol driver Affan Kurniawan.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1327,
      "kw": "HIGH-LEVEL ACCOUNTABILITY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief Listyo Sigit Prabowo met the family of an ojol driver fatally hit by a Brimob armored vehicle.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1328,
      "kw": "POLICE REFORM",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police Chief apologized for the fatal running over of an ojol driver and vowed to evaluate demonstration security protocols.",
      "rx_thm": "The entry highlights official commitment to investigate and address alleged misconduct by law enforcement."
    },
    {
      "rownum": 1329,
      "kw": "POLICE INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "National Police's Propam ensures transparent investigation into 7 Brimob members after a fatal incident.",
      "rx_thm": "The entry describes official inquiries into police actions, especially concerning misconduct or fatalities."
    },
    {
      "rownum": 1333,
      "kw": "POST-RIOT DISARRAY",
      "thm": "PUBLIC DISORDER",
      "rx_kw": "Pejompongan street is in disarray following a riotous demonstration, littered with debris and impassable traffic.",
      "rx_thm": "The entry describes the consequences and cleanup efforts following a disruptive public demonstration."
    },
    {
      "rownum": 1338,
      "kw": "GOVERNMENT DIALOGUE",
      "thm": "PROTEST RESPONSE",
      "rx_kw": "Government plans dialogue with labor leaders on demands following recent protests.",
      "rx_thm": "The entry describes official efforts to address grievances and engage with protesting groups."
    },
    {
      "rownum": 1345,
      "kw": "RIOT AFTERMATH",
      "thm": "PUBLIC ORDER",
      "rx_kw": "Riots at the DPR/MPR building subsided after police dispersed the crowd with tear gas.",
      "rx_thm": "The entry describes the consequences and cleanup efforts following a disruptive public demonstration."
    },
    {
      "rownum": 1346,
      "kw": "PROTEST DISTURBANCES",
      "thm": "PUBLIC ORDER",
      "rx_kw": "Polda Metro Jaya attributes protest disturbances to 'irresponsible parties' who vandalized property.",
      "rx_thm": "The entry describes actions taken by authorities to identify and address disruptive elements within protests."
    },
    {
      "rownum": 1353,
      "kw": "FATAL INCIDENT",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "A viral video shows a police tactical vehicle allegedly running over an online motorcycle taxi driver during protest dispersal.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    },
    {
      "rownum": 1354,
      "kw": "PUBLIC OUTRAGE",
      "thm": "PROTEST AFTERMATH",
      "rx_kw": "Online motorcycle taxi drivers and residents protested at Kwitang Mako Brimob, setting a police post on fire.",
      "rx_thm": "The entry describes the public's strong negative reaction and subsequent actions following a controversial incident."
    },
    {
      "rownum": 1355,
      "kw": "GOVERNMENT RESPONSE",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Mensesneg Prasetyo Hadi urged police caution after a Brimob vehicle allegedly killed an ojol driver.",
      "rx_thm": "The entry highlights official directives for police to handle protests with restraint and prioritize safety."
    },
    {
      "rownum": 1356,
      "kw": "GOVERNMENT OVERSIGHT",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Mensesneg requested National Police to prioritize the viral incident where an online motorcycle taxi driver died.",
      "rx_thm": "The entry highlights the role of government officials in monitoring and ensuring police adherence to law."
    },
    {
      "rownum": 1357,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "An online motorcycle taxi driver was killed by a Brimob Barracuda, prompting the National Police Chief's apology.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1360,
      "kw": "PROTEST FATALITY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Ojol driver Afan Kurniawan died after being run over by a Brimob Barracuda during a DPR protest.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    },
    {
      "rownum": 1362,
      "kw": "PUBLIC OUTRAGE",
      "thm": "PROTEST AFTERMATH",
      "rx_kw": "Ojol driver Affan Kurniawan was killed by a Brimob barracuda, sparking outrage and a storming of Kwitang Brimob HQ.",
      "rx_thm": "The entry describes the public's strong negative reaction and subsequent actions following a controversial incident."
    },
    {
      "rownum": 1363,
      "kw": "PROTEST ARRESTS",
      "thm": "POLICE CONDUCT",
      "rx_kw": "Police released 42 demonstrators arrested in Medan, balancing law enforcement with a humanistic approach.",
      "rx_thm": "The entry highlights police efforts to manage protests, including arrests and subsequent releases, with a focus on humane treatment."
    },
    {
      "rownum": 1364,
      "kw": "POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Kapolri Listyo Sigit Prabowo apologized for the fatal ojol incident and unrest at Kwitang Brimob HQ.",
      "rx_thm": "The entry highlights official acknowledgment of responsibility and regret for an incident involving police."
    },
    {
      "rownum": 1365,
      "kw": "POST-CLASH SECURITY",
      "thm": "PUBLIC ORDER",
      "rx_kw": "Anti-terror police maintained strict guard at Mako Brimob Kwitang following clashes with protesters.",
      "rx_thm": "The entry describes the measures taken to maintain safety and enforce rules after a public disturbance."
    },
    {
      "rownum": 1367,
      "kw": "FATAL INCIDENT",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "An ojol driver died after being run over by a Brimob tactical vehicle during clashes in Jakarta.",
      "rx_thm": "The entry describes a death occurring during a protest, raising questions about police actions."
    }
  ],
  "2025-08-29": [
    {
      "rownum": 1369,
      "kw": "POST-PROTEST SECURITY",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The summary focuses on security measures and lingering effects following protests.",
      "rx_thm": "The entry describes the immediate consequences and security situation after a period of public disturbance."
    },
    {
      "rownum": 1381,
      "kw": "GOVERNOR'S CONDOLENCES",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry highlights the Governor's visit and condolences to the victim's family.",
      "rx_thm": "The summary details the actions and statements made by government officials in response to the incident."
    },
    {
      "rownum": 1383,
      "kw": "POLICE INVESTIGATION",
      "thm": "ACCOUNTABILITY",
      "rx_kw": "The core of the entry is the ongoing investigation into police actions.",
      "rx_thm": "The summary highlights the police leadership's commitment to transparency and taking firm action against involved members."
    },
    {
      "rownum": 1386,
      "kw": "STUDENT PROTEST",
      "thm": "PUBLIC DEMONSTRATION",
      "rx_kw": "The entry explicitly states BEM SI, a student organization, is planning a large demonstration.",
      "rx_thm": "The summary describes an organized public gathering to express grievances against authorities."
    },
    {
      "rownum": 1387,
      "kw": "PROTEST CHAOS",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary describes how infiltrators caused a peaceful demonstration to become chaotic and violent.",
      "rx_thm": "The entry details the escalation of a protest into destructive and dangerous acts."
    },
    {
      "rownum": 1388,
      "kw": "OJOL DRIVER DEATH",
      "thm": "PUBLIC OUTRAGE",
      "rx_kw": "The central event is the death of an ojol driver, which sparked widespread public anger.",
      "rx_thm": "The summary highlights the strong negative public reaction and condemnation from various figures and organizations."
    },
    {
      "rownum": 1389,
      "kw": "RIOTS SPREAD",
      "thm": "WIDESPREAD UNREST",
      "rx_kw": "The summary indicates the unrest expanded geographically and intensified with violent acts.",
      "rx_thm": "The entry describes the expansion of violent public disturbances across different locations."
    },
    {
      "rownum": 1390,
      "kw": "AMNESTY CONDEMNS",
      "thm": "HUMAN RIGHTS CONCERNS",
      "rx_kw": "Amnesty International's condemnation of police actions is the main focus.",
      "rx_thm": "The entry highlights concerns raised by a human rights organization regarding police conduct and excessive force."
    },
    {
      "rownum": 1391,
      "kw": "OFFICER KIDNAPPED",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The kidnapping of a police officer is a significant violent act described in the summary.",
      "rx_thm": "The entry details violent actions by protesters, including abduction and property destruction, during the unrest."
    },
    {
      "rownum": 1392,
      "kw": "POLICE CLASHES",
      "thm": "PROTEST CONFRONTATION",
      "rx_kw": "The summary describes direct violent encounters between police and protesters.",
      "rx_thm": "The entry focuses on the direct and often violent interactions between law enforcement and demonstrators."
    },
    {
      "rownum": 1395,
      "kw": "MUI CONDOLENCES",
      "thm": "CALL FOR JUSTICE",
      "rx_kw": "The entry highlights the religious leader's expression of sympathy and demands for action.",
      "rx_thm": "The summary includes calls from a prominent figure for prosecution, empathy, and addressing public anger."
    },
    {
      "rownum": 1397,
      "kw": "ONGOING PROTEST",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The summary emphasizes the continuation of protests and clashes at a key location.",
      "rx_thm": "The entry describes persistent public disturbances and confrontations with security forces."
    },
    {
      "rownum": 1399,
      "kw": "RIOT DISPERSAL",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The summary focuses on the conclusion of the riot and the return to normal conditions.",
      "rx_thm": "The entry describes the resolution of a violent public disturbance and subsequent actions by authorities."
    },
    {
      "rownum": 1402,
      "kw": "EAST JAKARTA RIOT",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary details a violent public disturbance specifically in East Jakarta.",
      "rx_thm": "The entry describes destructive actions by protesters, including arson and abduction, during clashes with police."
    },
    {
      "rownum": 1405,
      "kw": "OFFICER ABDUCTION",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The brief kidnapping of a police officer is a key violent event in the summary.",
      "rx_thm": "The entry details violent actions by protesters, including abduction and property destruction, during the unrest."
    },
    {
      "rownum": 1407,
      "kw": "KAMMI CONDEMNS",
      "thm": "POLICE CONDUCT CRITIQUE",
      "rx_kw": "The entry highlights KAMMI's condemnation of police actions and demands for reform.",
      "rx_thm": "The summary focuses on criticism of police methods and calls for a more humane approach and oversight."
    },
    {
      "rownum": 1408,
      "kw": "MARINE INTERVENTION",
      "thm": "MILITARY ROLE",
      "rx_kw": "The summary describes the involvement of the Marine Corps in attempting to de-escalate the protest.",
      "rx_thm": "The entry highlights the military's attempt to manage public unrest and maintain order."
    },
    {
      "rownum": 1409,
      "kw": "POLRI BIADAB BANNERS",
      "thm": "PUBLIC OUTRAGE",
      "rx_kw": "The appearance of critical banners in Bali signifies widespread public anger against the police.",
      "rx_thm": "The entry describes a strong public reaction and criticism of police actions, extending beyond Jakarta."
    },
    {
      "rownum": 1412,
      "kw": "OJOL PROTEST",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The entry describes a protest specifically by ojol drivers that escalated into riots.",
      "rx_thm": "The summary details a violent public disturbance stemming from the death of an ojol driver."
    },
    {
      "rownum": 1413,
      "kw": "BRIMOB APOLOGY",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry highlights Brimob's apology and statement regarding the involved personnel.",
      "rx_thm": "The summary details the official statement and actions taken by the police in response to the protest."
    },
    {
      "rownum": 1415,
      "kw": "EVENTS POSTPONED",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The postponement of government events is a direct consequence of the escalating demonstrations.",
      "rx_thm": "The entry highlights the impact of public unrest on government functions and daily operations."
    },
    {
      "rownum": 1419,
      "kw": "PROTEST CLEANUP",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The summary focuses on the post-protest cleanup and lingering effects around the protest site.",
      "rx_thm": "The entry describes the immediate consequences and restoration efforts following a public disturbance."
    },
    {
      "rownum": 1421,
      "kw": "PROTEST DISPERSAL",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry describes the end of the protest following an apology from officials.",
      "rx_thm": "The summary details the official actions and statements that led to the resolution of the protest."
    },
    {
      "rownum": 1429,
      "kw": "STUDENT PROTEST",
      "thm": "DEMANDS FOR JUSTICE",
      "rx_kw": "The entry highlights the planned protests by university students demanding action.",
      "rx_thm": "The summary focuses on the students' calls for accountability and justice regarding the ojol driver's death."
    },
    {
      "rownum": 1430,
      "kw": "MILITARY DE-ESCALATION",
      "thm": "MILITARY ROLE",
      "rx_kw": "The entry describes a military official's efforts to calm protesters and assure an investigation.",
      "rx_thm": "The summary highlights the military's involvement in managing public unrest and encouraging peaceful resolution."
    },
    {
      "rownum": 1434,
      "kw": "PROTEST DIALOGUE",
      "thm": "CONFLICT RESOLUTION",
      "rx_kw": "The entry highlights the use of dialogue between officials and protesters to resolve the situation.",
      "rx_thm": "The summary describes the process of communication and negotiation leading to the dispersal of protesters and restoration of order."
    },
    {
      "rownum": 1435,
      "kw": "STUDENT OUTRAGE",
      "thm": "DEMANDS FOR ACCOUNTABILITY",
      "rx_kw": "The entry emphasizes the strong emotional reaction and demands from students regarding the ojol driver's death.",
      "rx_thm": "The summary focuses on the students' calls for holding those responsible for the incident to account."
    },
    {
      "rownum": 1437,
      "kw": "OFFICIAL CONDOLENCES",
      "thm": "GOVERNMENT COMMITMENT",
      "rx_kw": "The entry highlights the expressions of sympathy and promises of investigation from high-ranking officials.",
      "rx_thm": "The summary focuses on the government's pledge to ensure justice and conduct a thorough investigation."
    },
    {
      "rownum": 1439,
      "kw": "PRESIDENTIAL CONCERN",
      "thm": "PRESIDENTIAL DIRECTIVE",
      "rx_kw": "The entry highlights the President's strong emotional reaction and his subsequent orders for action.",
      "rx_thm": "The summary focuses on the President's instructions for investigation, family support, and maintaining public order."
    },
    {
      "rownum": 1442,
      "kw": "PRESIDENTIAL APPEAL",
      "thm": "NATIONAL STABILITY",
      "rx_kw": "The entry highlights the President's call for the public to remain calm and trust the government.",
      "rx_thm": "The summary focuses on the President's efforts to restore order and prevent further disruption to national progress."
    },
    {
      "rownum": 1443,
      "kw": "PRESIDENTIAL ORDER",
      "thm": "ACCOUNTABILITY",
      "rx_kw": "The entry highlights the President's direct command for a comprehensive investigation and strict action.",
      "rx_thm": "The summary focuses on the President's commitment to holding responsible parties accountable and ensuring justice."
    },
    {
      "rownum": 1444,
      "kw": "PRESIDENTIAL WARNING",
      "thm": "NATIONAL STABILITY",
      "rx_kw": "The entry highlights the President's caution against those who might exploit the situation for chaos.",
      "rx_thm": "The summary focuses on the President's efforts to maintain order and protect national development amidst public grievances."
    },
    {
      "rownum": 1446,
      "kw": "PROTEST AFTERMATH",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry describes the consequences and official actions taken after a protest was dispersed.",
      "rx_thm": "The summary details the police's apology, detention of officers, and engagement with victims' families."
    },
    {
      "rownum": 1447,
      "kw": "PRESIDENTIAL SORROW",
      "thm": "PRESIDENTIAL DIRECTIVE",
      "rx_kw": "The entry highlights the President's emotional response and his subsequent promises for action and calm.",
      "rx_thm": "The summary focuses on the President's instructions for investigation, family support, and maintaining public order."
    },
    {
      "rownum": 1449,
      "kw": "CIVIL SOCIETY DEMANDS",
      "thm": "HUMAN RIGHTS CONCERNS",
      "rx_kw": "The entry highlights the demands from civil society for transparency and action regarding police conduct.",
      "rx_thm": "The summary focuses on concerns raised by civil society regarding police power, human rights, and impunity."
    },
    {
      "rownum": 1452,
      "kw": "POLDA SALAT GAIB",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry highlights the police's symbolic gesture of prayer for the victim.",
      "rx_thm": "The summary details an official act by the police in response to the ojol driver's death and public sentiment."
    },
    {
      "rownum": 1454,
      "kw": "PRESIDENTIAL STATEMENT",
      "thm": "PRESIDENTIAL RESPONSE",
      "rx_kw": "The entry highlights the President's official communication regarding the protest and fatality.",
      "rx_thm": "The summary focuses on the President's direct address concerning the public incident and unrest."
    },
    {
      "rownum": 1455,
      "kw": "DPR CHAIR CONDOLENCES",
      "thm": "GOVERNMENT INTERVENTION",
      "rx_kw": "The entry highlights the DPR Chair's expression of sympathy and call for investigation.",
      "rx_thm": "The summary details the legislative body's involvement and demands for accountability regarding the incident."
    },
    {
      "rownum": 1458,
      "kw": "JOINT PROTEST",
      "thm": "PUBLIC DEMONSTRATION",
      "rx_kw": "The entry describes a combined protest effort by ojol drivers and students.",
      "rx_thm": "The summary details a large, organized public gathering to demand justice and protest authorities' actions."
    },
    {
      "rownum": 1459,
      "kw": "INFILTRATORS VANDALISM",
      "thm": "PROTEST MANIPULATION",
      "rx_kw": "The summary highlights the role of unidentified individuals causing vandalism and chaos during the protest.",
      "rx_thm": "The entry suggests external actors or infiltrators are influencing and escalating protests for specific agendas."
    },
    {
      "rownum": 1460,
      "kw": "ECONOMIC GRIEVANCES",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The entry highlights the underlying socio-economic issues driving the protests, such as DPR allowances and high prices.",
      "rx_thm": "The summary describes widespread public demonstrations fueled by economic dissatisfaction and resulting in clashes."
    },
    {
      "rownum": 1461,
      "kw": "PUBLIC FRUSTRATION",
      "thm": "POLITICAL CLIMATE",
      "rx_kw": "The entry describes widespread public dissatisfaction with government policies and the resulting unrest.",
      "rx_thm": "The summary provides an overview of the tense political environment characterized by public anger and protests."
    },
    {
      "rownum": 1464,
      "kw": "DECLINING DEMOCRACY",
      "thm": "SYSTEMIC CRITIQUE",
      "rx_kw": "The entry explicitly discusses the perceived deterioration of democratic principles in Indonesia.",
      "rx_thm": "The summary offers a broad criticism of the political system, linking the ojol driver's death to systemic injustice."
    },
    {
      "rownum": 1465,
      "kw": "DIVERSE NATIONAL EVENTS",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry summarizes a variety of unrelated significant occurrences across the nation.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events in the country."
    },
    {
      "rownum": 1466,
      "kw": "COMBATING DISINFORMATION",
      "thm": "INFORMATION SECURITY",
      "rx_kw": "The entry focuses on government efforts to counter false information and its negative impacts.",
      "rx_thm": "The summary highlights the importance of protecting the public from misleading information and its role in national stability."
    },
    {
      "rownum": 1467,
      "kw": "WELFARE ISSUES",
      "thm": "SOCIO-ECONOMIC GRIEVANCES",
      "rx_kw": "The entry identifies underlying social and economic problems as the root cause of the demonstrations.",
      "rx_thm": "The summary focuses on the public's dissatisfaction with economic conditions and welfare provisions."
    },
    {
      "rownum": 1472,
      "kw": "PRESIDENTIAL ADDRESS",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The entry highlights the President's comprehensive statement addressing the protests and fatality.",
      "rx_thm": "The summary details the official actions and statements from both the President and police chief in response to the unrest."
    },
    {
      "rownum": 1473,
      "kw": "PRESIDENTIAL CONDOLENCES",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry highlights the President's expression of sympathy for the victim.",
      "rx_thm": "The summary details the President's official reaction to the protest fatality and the subsequent police actions."
    },
    {
      "rownum": 1475,
      "kw": "BRIMOB COMMANDER ADDRESS",
      "thm": "OFFICIAL RESPONSE",
      "rx_kw": "The entry highlights the Brimob commander's direct communication with protesters and promise of investigation.",
      "rx_thm": "The summary details the official statement and commitment to transparency from police leadership in response to public anger."
    },
    {
      "rownum": 1476,
      "kw": "MPR LEADER CALL",
      "thm": "CALL FOR CALM",
      "rx_kw": "The entry highlights the MPR leader's appeal for peaceful demonstrations and public safety.",
      "rx_thm": "The summary focuses on the official encouragement for order, dialogue, and prevention of further unrest."
    },
    {
      "rownum": 1477,
      "kw": "DPR SUMMONS POLICE",
      "thm": "PARLIAMENTARY OVERSIGHT",
      "rx_kw": "The entry highlights the legislative body's decision to call the National Police for investigation.",
      "rx_thm": "The summary focuses on the role of the DPR in scrutinizing police actions and ensuring accountability."
    },
    {
      "rownum": 1478,
      "kw": "INTERNATIONAL COVERAGE",
      "thm": "GLOBAL ATTENTION",
      "rx_kw": "The entry highlights that the incident garnered reports from international media.",
      "rx_thm": "The summary focuses on the worldwide recognition and scrutiny of the events in Jakarta."
    },
    {
      "rownum": 1479,
      "kw": "BANTEN OJOL PROTEST",
      "thm": "REGIONAL SOLIDARITY",
      "rx_kw": "The entry describes a protest by ojol drivers specifically in the Banten region.",
      "rx_thm": "The summary highlights support and demands for justice from a different region in response to the incident."
    },
    {
      "rownum": 1480,
      "kw": "PROPAM EXAMINATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The entry highlights the internal police division's investigation into the involved personnel.",
      "rx_thm": "The summary focuses on the internal police process to ensure responsibility and transparency for the incident."
    },
    {
      "rownum": 1481,
      "kw": "PRESIDENTIAL CALL",
      "thm": "NATIONAL STABILITY",
      "rx_kw": "The entry highlights the President's appeal for public calm and trust in the government.",
      "rx_thm": "The summary focuses on the President's efforts to maintain order and stability during a volatile political period."
    },
    {
      "rownum": 1485,
      "kw": "COMPREHENSIVE RESPONSE",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The entry details a wide range of official actions and commitments from police leadership.",
      "rx_thm": "The summary focuses on the various measures taken by police to ensure responsibility, transparency, and learning from the incident."
    },
    {
      "rownum": 1487,
      "kw": "CARS BURNED",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The burning of multiple cars is a significant act of destruction during the riots.",
      "rx_thm": "The entry describes the escalation of public unrest into destructive and violent acts."
    },
    {
      "rownum": 1488,
      "kw": "DIVERSE NEWS",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry summarizes a wide array of unrelated national and international events.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events in the country and globally."
    },
    {
      "rownum": 1489,
      "kw": "BRIMOB HQ CLASHES",
      "thm": "PROTEST CONFRONTATION",
      "rx_kw": "The entry describes direct and violent encounters between protesters and security forces at the headquarters.",
      "rx_thm": "The summary focuses on the escalating and often violent interactions between law enforcement and demonstrators."
    },
    {
      "rownum": 1491,
      "kw": "MINISTER'S PROMISE",
      "thm": "GOVERNMENT INTERVENTION",
      "rx_kw": "The entry highlights a high-ranking minister's commitment to a transparent investigation and critique of police methods.",
      "rx_thm": "The summary details the involvement of a government minister in addressing the incident and calling for police reform."
    },
    {
      "rownum": 1495,
      "kw": "SYARIKAT ISLAM CALL",
      "thm": "CALL FOR UNITY",
      "rx_kw": "The entry highlights the religious organization's call for police evaluation, legal action, and national unity.",
      "rx_thm": "The summary focuses on the appeal from a prominent religious body for social cohesion and responsible actions from authorities."
    },
    {
      "rownum": 1499,
      "kw": "PROTEST ESCALATION",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes the increase in intensity and destructive actions during the protest.",
      "rx_thm": "The summary details the transformation of a demonstration into violent acts, including property damage and traffic disruption."
    },
    {
      "rownum": 1500,
      "kw": "STUDENT DEMANDS",
      "thm": "POLICE REFORM",
      "rx_kw": "The entry highlights the specific requests from students for accountability and systemic changes within the police.",
      "rx_thm": "The summary focuses on the calls for structural changes and improvements in police conduct and practices."
    },
    {
      "rownum": 1501,
      "kw": "GMKI CONDEMNS",
      "thm": "POLICE CONDUCT CRITIQUE",
      "rx_kw": "The entry highlights GMKI's strong condemnation of police repressive actions and violence.",
      "rx_thm": "The summary focuses on the criticism of police methods and the assertion that police should protect, not harm, citizens."
    },
    {
      "rownum": 1502,
      "kw": "VIOLENT PROTESTS",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes the protests escalating into destructive and violent acts, including arson and property damage.",
      "rx_thm": "The summary details the widespread public anger manifesting in destructive actions and clashes."
    },
    {
      "rownum": 1503,
      "kw": "PROTESTERS ENTER HQ",
      "thm": "DIRECT CONFRONTATION",
      "rx_kw": "The entry describes demonstrators breaching the police headquarters' premises.",
      "rx_thm": "The summary highlights the direct interaction and demands made by protesters to police officials."
    },
    {
      "rownum": 1504,
      "kw": "BEM UI MOBILIZATION",
      "thm": "STUDENT ACTIVISM",
      "rx_kw": "The entry highlights the organized movement of BEM UI students to join a protest.",
      "rx_thm": "The summary focuses on the active participation of students in demonstrations against police actions."
    },
    {
      "rownum": 1505,
      "kw": "PPI DUNIA URGES",
      "thm": "HUMAN RIGHTS ADVOCACY",
      "rx_kw": "The entry highlights the international student organization's call for human rights protection and investigation.",
      "rx_thm": "The summary focuses on the advocacy for fundamental rights, including freedom of expression and protection against excessive force."
    },
    {
      "rownum": 1506,
      "kw": "CHILDREN APPREHENDED",
      "thm": "CHILD WELFARE",
      "rx_kw": "The entry focuses on the detention and care of minors involved in the protests.",
      "rx_thm": "The summary highlights concerns and actions taken regarding the safety and well-being of children during demonstrations."
    },
    {
      "rownum": 1508,
      "kw": "BRIMOB DRIVER KILLS",
      "thm": "POLICE MISCONDUCT",
      "rx_kw": "The entry highlights the direct involvement of a Brimob driver in the ojol driver's death.",
      "rx_thm": "The summary focuses on the unethical and fatal actions of police personnel and the high-level response to it."
    },
    {
      "rownum": 1509,
      "kw": "UI STUDENTS PROTEST",
      "thm": "DEMANDS FOR JUSTICE",
      "rx_kw": "The entry highlights the organized protest by UI students demanding accountability for the ojol driver's death.",
      "rx_thm": "The summary focuses on the students' calls for fairness and a change in police conduct."
    },
    {
      "rownum": 1510,
      "kw": "MAKO BRIMOB GUARDED",
      "thm": "HEIGHTENED SECURITY",
      "rx_kw": "The entry highlights the increased security presence and protection around the Brimob headquarters.",
      "rx_thm": "The summary focuses on the implementation of intensified security protocols due to the volatile situation."
    },
    {
      "rownum": 1511,
      "kw": "JAKARTA CLASHES",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes widespread violent confrontations between citizens and police in Jakarta.",
      "rx_thm": "The summary details the escalation of public unrest into destructive and violent acts across the city."
    },
    {
      "rownum": 1512,
      "kw": "STUDENTS BREACH GATE",
      "thm": "PROTEST ESCALATION",
      "rx_kw": "The entry highlights students forcibly entering the police headquarters, signifying an escalation of the protest.",
      "rx_thm": "The summary describes the intensification of the student protest through direct and aggressive actions."
    },
    {
      "rownum": 1513,
      "kw": "MOTHERS PROTEST",
      "thm": "COMMUNITY ACTIVISM",
      "rx_kw": "The entry highlights the participation of mothers in the protest, representing broader community involvement.",
      "rx_thm": "The summary focuses on the collective action of a community segment demanding justice and reform."
    },
    {
      "rownum": 1514,
      "kw": "ETHICAL VIOLATIONS",
      "thm": "POLICE MISCONDUCT",
      "rx_kw": "The entry highlights the formal finding of ethical breaches by Brimob members.",
      "rx_thm": "The summary focuses on the unethical and fatal actions of police personnel and the resulting public anger."
    },
    {
      "rownum": 1515,
      "kw": "PALACE URGES CALM",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The entry highlights the Presidential Palace's call for police to maintain order and calm.",
      "rx_thm": "The summary details official reactions and actions from government bodies in response to the unrest."
    },
    {
      "rownum": 1516,
      "kw": "ETHICS VIOLATION",
      "thm": "INTERNAL DISCIPLINE",
      "rx_kw": "The entry confirms the formal finding of ethical breaches by Brimob members.",
      "rx_thm": "The summary focuses on the internal disciplinary actions taken within the police force."
    },
    {
      "rownum": 1517,
      "kw": "PROTEST PROPERTY DAMAGE",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the destruction of property, including a police car, during the protests.",
      "rx_thm": "The summary details the escalation of protests into violent confrontations and property destruction."
    },
    {
      "rownum": 1518,
      "kw": "BOGOR PROTEST",
      "thm": "REGIONAL SOLIDARITY",
      "rx_kw": "The entry describes a protest specifically occurring in Bogor City, showing support for the victim.",
      "rx_thm": "The summary highlights the spread of protests and demands for justice to other regions."
    },
    {
      "rownum": 1519,
      "kw": "DPR GATE BREACH",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights protesters forcibly entering the parliament building's premises.",
      "rx_thm": "The summary describes aggressive actions by protesters, including breaching security and throwing objects, at a government building."
    },
    {
      "rownum": 1520,
      "kw": "BEM SI DEMANDS",
      "thm": "STUDENT ACTIVISM",
      "rx_kw": "The entry highlights the specific demands made by BEM SI students during their protest.",
      "rx_thm": "The summary focuses on the active role of students in demanding transparency and accountability from authorities."
    },
    {
      "rownum": 1521,
      "kw": "TRANSJAKARTA DISRUPTION",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the impact of protests on public transportation services.",
      "rx_thm": "The summary focuses on the disruption to daily life and public services caused by the ongoing unrest."
    },
    {
      "rownum": 1522,
      "kw": "BRIMOB DRIVER IDENTIFIED",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The entry highlights the identification of the specific police officer responsible for the fatality.",
      "rx_thm": "The summary focuses on the process of holding individual police officers responsible for their actions."
    },
    {
      "rownum": 1523,
      "kw": "PROTEST DAMAGE",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the destruction of property, including burning tires and damaging police equipment.",
      "rx_thm": "The entry describes the escalation of protests into destructive acts and property damage."
    },
    {
      "rownum": 1524,
      "kw": "ALISSA WAHID CALLS",
      "thm": "DEMOCRATIC PRINCIPLES",
      "rx_kw": "The entry highlights Alissa Wahid's call for police re-evaluation based on democratic values.",
      "rx_thm": "The summary focuses on the importance of upholding citizens' rights and humane conduct in a democratic society."
    },
    {
      "rownum": 1525,
      "kw": "STUDENT PROTEST",
      "thm": "PUBLIC UNREST",
      "rx_kw": "The entry describes a protest specifically by student groups at the National Police Headquarters.",
      "rx_thm": "The summary details the public disturbance and aggressive actions by students at a key police facility."
    },
    {
      "rownum": 1526,
      "kw": "PERSISTENT OJOL PROTEST",
      "thm": "DEMANDS FOR JUSTICE",
      "rx_kw": "The entry highlights the ongoing nature of the ojol drivers' protest and their demands.",
      "rx_thm": "The summary focuses on the continuous public calls for fairness and accountability regarding the ojol driver's death."
    },
    {
      "rownum": 1527,
      "kw": "BRIMOB NAMES REVEALED",
      "thm": "POLICE TRANSPARENCY",
      "rx_kw": "The entry highlights the police chief's action of disclosing the names of involved officers to protesters.",
      "rx_thm": "The summary focuses on the police's effort to demonstrate openness and accountability in the investigation."
    },
    {
      "rownum": 1528,
      "kw": "MUHAMMADIYAH URGES PEACE",
      "thm": "CALL FOR CALM",
      "rx_kw": "The entry highlights the religious organization's appeal for an end to violence and promotion of dialogue.",
      "rx_thm": "The summary focuses on the plea from a prominent religious body for social harmony and peaceful resolution."
    },
    {
      "rownum": 1530,
      "kw": "PROTEST PROPERTY DAMAGE",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the destruction of property, including burning tires and damaging police equipment.",
      "rx_thm": "The entry describes the escalation of protests into destructive acts and property damage."
    },
    {
      "rownum": 1531,
      "kw": "JOINT PROTEST",
      "thm": "DEMANDS FOR ACCOUNTABILITY",
      "rx_kw": "The entry describes a combined protest effort by BEM SI students and ojol drivers.",
      "rx_thm": "The summary focuses on the protesters' calls for holding security forces responsible for their actions."
    },
    {
      "rownum": 1532,
      "kw": "MASSIVE DEMONSTRATION",
      "thm": "PUBLIC GATHERING",
      "rx_kw": "The entry emphasizes the large scale and significant number of participants in the protest.",
      "rx_thm": "The summary describes a substantial public assembly expressing grievances."
    },
    {
      "rownum": 1535,
      "kw": "MOLOTOV COCKTAIL",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The use of a Molotov cocktail signifies a dangerous escalation of violence in the protest.",
      "rx_thm": "The summary details the intense and dangerous confrontations between protesters and police, including the use of incendiary devices."
    },
    {
      "rownum": 1536,
      "kw": "STUDENT SOLIDARITY",
      "thm": "STUDENT ACTIVISM",
      "rx_kw": "The entry highlights the students' collective expression of support and mourning for the victim.",
      "rx_thm": "The summary focuses on the active participation of students in demanding justice and expressing their grievances."
    },
    {
      "rownum": 1537,
      "kw": "WIDESPREAD VIOLENCE",
      "thm": "PROTEST ESCALATION",
      "rx_kw": "The entry describes the extensive spread and intensification of violent protests across multiple locations in Jakarta.",
      "rx_thm": "The summary details the increasing severity and geographical reach of violent public disturbances."
    },
    {
      "rownum": 1538,
      "kw": "HQ ATTACK",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes protesters using Molotov cocktails and setting fires at the police headquarters.",
      "rx_thm": "The summary details the aggressive and destructive actions taken by protesters against a key police facility."
    },
    {
      "rownum": 1540,
      "kw": "YOGYAKARTA PROTEST",
      "thm": "REGIONAL SOLIDARITY",
      "rx_kw": "The entry describes a protest specifically by ojol drivers in Yogyakarta, showing support for the victim.",
      "rx_thm": "The summary highlights the spread of protests and demands for justice to other regions."
    },
    {
      "rownum": 1542,
      "kw": "BUILDING FIRE",
      "thm": "PROPERTY DAMAGE",
      "rx_kw": "The entry highlights the destruction of a building by fire during the protest.",
      "rx_thm": "The summary focuses on the physical destruction of property as a result of the protest activities."
    },
    {
      "rownum": 1543,
      "kw": "PRESIDENTIAL SHOCK",
      "thm": "PRESIDENTIAL DIRECTIVE",
      "rx_kw": "The entry highlights the President's strong emotional reaction and his subsequent orders for action.",
      "rx_thm": "The summary focuses on the President's instructions for investigation, family support, and maintaining public order."
    },
    {
      "rownum": 1544,
      "kw": "BANDUNG ARSON",
      "thm": "REGIONAL VIOLENCE",
      "rx_kw": "The entry highlights the act of setting fire to a house and motorcycle during the protest in Bandung.",
      "rx_thm": "The summary describes the escalation of a regional solidarity protest into destructive and violent acts."
    },
    {
      "rownum": 1545,
      "kw": "PROTEST SHIFT",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry describes the movement of the protest to a new location, causing further disruption.",
      "rx_thm": "The summary focuses on the ongoing impact of protests on urban infrastructure and daily life."
    },
    {
      "rownum": 1546,
      "kw": "GOVERNOR'S AID",
      "thm": "OFFICIAL SUPPORT",
      "rx_kw": "The entry highlights the West Java Governor's offer of material and familial support to the victim's family.",
      "rx_thm": "The summary focuses on the government's provision of assistance and care to those affected by the incident."
    },
    {
      "rownum": 1547,
      "kw": "DPR VICE CHAIRMAN",
      "thm": "LEGISLATIVE OVERSIGHT",
      "rx_kw": "The entry highlights the statement from a high-ranking legislative official regarding the incident.",
      "rx_thm": "The summary focuses on the role of the legislative body in demanding justice and accountability."
    },
    {
      "rownum": 1549,
      "kw": "POLICE INJURIES",
      "thm": "PROTEST CASUALTIES",
      "rx_kw": "The entry highlights the number of police officers who sustained injuries during the riots.",
      "rx_thm": "The summary focuses on the human cost and physical harm resulting from the violent demonstrations."
    },
    {
      "rownum": 1551,
      "kw": "MRT CLOSURES",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the impact of protests on public transportation services, specifically MRT.",
      "rx_thm": "The summary focuses on the disruption to daily life and public services caused by the ongoing unrest."
    },
    {
      "rownum": 1555,
      "kw": "POLICE INJURIES",
      "thm": "PROTEST CASUALTIES",
      "rx_kw": "The entry highlights the number of police officers who sustained injuries during the violent demonstration.",
      "rx_thm": "The summary focuses on the human cost and physical harm resulting from the violent protests."
    },
    {
      "rownum": 1558,
      "kw": "POLICE REFORM DEMANDS",
      "thm": "SYSTEMIC CHANGE",
      "rx_kw": "The entry highlights the protesters' calls for fundamental changes within the police institution.",
      "rx_thm": "The summary focuses on the public's desire for broad, structural improvements in governance and law enforcement."
    },
    {
      "rownum": 1563,
      "kw": "PRESIDENTIAL APPEAL",
      "thm": "NATIONAL STABILITY",
      "rx_kw": "The entry highlights the President's call for public calm and trust in the government.",
      "rx_thm": "The summary focuses on the President's efforts to restore order and prevent further disruption to national progress."
    },
    {
      "rownum": 1564,
      "kw": "PALACE URGES CALM",
      "thm": "GOVERNMENT DIRECTIVE",
      "rx_kw": "The entry highlights the Presidential Palace's call for police to maintain order and calm.",
      "rx_thm": "The summary focuses on the government's instructions to the police regarding conduct and maintaining public peace."
    },
    {
      "rownum": 1565,
      "kw": "STUDENT MOBILIZATION",
      "thm": "STUDENT ACTIVISM",
      "rx_kw": "The entry highlights the organized movement of student groups to protest against authorities.",
      "rx_thm": "The summary focuses on the active participation of youth in demonstrations against perceived state violence."
    },
    {
      "rownum": 1566,
      "kw": "POLICE PREPARATION",
      "thm": "PROTEST MANAGEMENT",
      "rx_kw": "The entry highlights the police's readiness and deployment of resources for an anticipated protest.",
      "rx_thm": "The summary focuses on the strategies and measures taken by law enforcement to handle demonstrations."
    },
    {
      "rownum": 1567,
      "kw": "DPR BUILDING CLASHES",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes violent confrontations and property damage specifically at the DPR building.",
      "rx_thm": "The summary details the escalation of protests into aggressive and destructive acts at a government facility."
    },
    {
      "rownum": 1568,
      "kw": "PROTEST SUBSIDES",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The entry indicates the decrease in intensity and eventual calming of the protest.",
      "rx_thm": "The summary describes the winding down of a public disturbance and the lingering effects."
    },
    {
      "rownum": 1569,
      "kw": "CENTRAL JAVA PROTEST",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The entry describes a large protest specifically occurring at the Central Java Police Headquarters.",
      "rx_thm": "The entry highlights public disturbances and clashes in a region outside the capital."
    },
    {
      "rownum": 1571,
      "kw": "JAKARTA PROTESTS",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry describes widespread violent protests occurring in Jakarta.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events, including the protests, in the country."
    },
    {
      "rownum": 1572,
      "kw": "DIVERSE NATIONAL NEWS",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry summarizes a wide array of unrelated national events alongside the protests.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events in the country."
    },
    {
      "rownum": 1575,
      "kw": "BUS STOP BURNED",
      "thm": "PROPERTY DAMAGE",
      "rx_kw": "The entry highlights the destruction of a public facility, a TransJakarta bus stop, by fire.",
      "rx_thm": "The summary focuses on the physical destruction of public property as a result of the protest activities."
    },
    {
      "rownum": 1576,
      "kw": "CARS BURNED",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the burning of multiple vehicles by an anarchist mob.",
      "rx_thm": "The summary focuses on the extensive physical destruction of property during the violent protest."
    },
    {
      "rownum": 1579,
      "kw": "WIDESPREAD PROTESTS",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry describes large-scale, ongoing protests across multiple key locations in Jakarta.",
      "rx_thm": "The summary focuses on the significant impact of protests on urban infrastructure and public services."
    },
    {
      "rownum": 1580,
      "kw": "TODDLER EXPOSED",
      "thm": "PUBLIC SAFETY CONCERN",
      "rx_kw": "The entry highlights the dangerous exposure of a toddler to tear gas during the chaotic protest.",
      "rx_thm": "The summary focuses on the risks posed to the general public, especially vulnerable individuals, during violent demonstrations."
    },
    {
      "rownum": 1581,
      "kw": "MOTHER'S PROTEST",
      "thm": "COMMUNITY OUTRAGE",
      "rx_kw": "The entry highlights the protest by a mother, symbolizing broader community anger and demands.",
      "rx_thm": "The summary focuses on the strong emotional reaction and criticism from the public towards authorities."
    },
    {
      "rownum": 1583,
      "kw": "PROTEST ARSON",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the act of burning a bus stop and shelter during the escalating protest.",
      "rx_thm": "The summary details the destructive and aggressive actions taken by protesters, including setting fires."
    },
    {
      "rownum": 1586,
      "kw": "PROTEST DISPERSAL",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The entry describes the end of the protest and the subsequent return to normal conditions.",
      "rx_thm": "The summary focuses on the resolution of a public disturbance and the cleanup efforts."
    },
    {
      "rownum": 1587,
      "kw": "POLICE ASSURANCE",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The entry highlights the National Police Headquarters' pledge for a transparent investigation.",
      "rx_thm": "The summary focuses on the police's commitment to responsibility and building public trust."
    },
    {
      "rownum": 1588,
      "kw": "PREVENTING STUDENT PROTESTS",
      "thm": "PROTEST MANAGEMENT",
      "rx_kw": "The entry highlights police actions to stop students from joining demonstrations.",
      "rx_thm": "The summary focuses on law enforcement strategies to control and prevent public gatherings."
    },
    {
      "rownum": 1590,
      "kw": "JUSTICE DEMANDS",
      "thm": "PUBLIC OUTCRY",
      "rx_kw": "The entry highlights the protesters' calls for fairness and accountability for the ojol driver's death.",
      "rx_thm": "The summary focuses on the strong public expression of anger and demands for official action."
    },
    {
      "rownum": 1591,
      "kw": "PRESIDENTIAL VISIT",
      "thm": "PRESIDENTIAL RESPONSE",
      "rx_kw": "The entry highlights the President's personal visit to the victim's wake to offer condolences.",
      "rx_thm": "The summary focuses on the President's direct engagement and reaction to the protest fatality."
    },
    {
      "rownum": 1592,
      "kw": "RECTOR'S URGING",
      "thm": "STUDENT GUIDANCE",
      "rx_kw": "The entry highlights the university rector's advice to students regarding protest conduct and safety.",
      "rx_thm": "The summary focuses on official guidance provided to students participating in demonstrations."
    },
    {
      "rownum": 1593,
      "kw": "DPRD BUILDING BURNED",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the act of setting fire to a government building by a mob.",
      "rx_thm": "The summary focuses on the extensive physical destruction of property, specifically a government facility, during a violent protest."
    },
    {
      "rownum": 1594,
      "kw": "MAYOR INSPECTS DAMAGE",
      "thm": "COMMUNITY RECOVERY",
      "rx_kw": "The entry highlights the mayor's assessment of damage and commitment to repair and compensation.",
      "rx_thm": "The summary focuses on efforts to address the consequences of protests and support affected communities."
    },
    {
      "rownum": 1595,
      "kw": "BRIMOB DISPERSAL",
      "thm": "PROTEST CONFRONTATION",
      "rx_kw": "The entry describes Brimob's use of force to break up demonstrators at their headquarters.",
      "rx_thm": "The summary focuses on the direct and often violent interactions between law enforcement and demonstrators."
    },
    {
      "rownum": 1596,
      "kw": "VIOLENT PROTEST",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes the protest escalating into destructive and violent acts, including arson and property damage.",
      "rx_thm": "The summary details the widespread public anger manifesting in destructive actions and clashes."
    },
    {
      "rownum": 1597,
      "kw": "PROTEST ESCALATION",
      "thm": "PUBLIC OUTRAGE",
      "rx_kw": "The entry describes the increase in intensity and destructive actions during the protest.",
      "rx_thm": "The summary focuses on the strong public expression of anger and demands for official action."
    },
    {
      "rownum": 1599,
      "kw": "MASSIVE TRAFFIC JAM",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the significant impact of the protest on urban traffic flow.",
      "rx_thm": "The summary focuses on the disruption to daily life and public services caused by the ongoing unrest."
    },
    {
      "rownum": 1600,
      "kw": "PUBLIC FACILITIES BURNED",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the burning of public infrastructure, including bus stops, during the protests.",
      "rx_thm": "The summary focuses on the extensive physical destruction of public property during violent demonstrations."
    },
    {
      "rownum": 1601,
      "kw": "PRESIDENT WIDODO VISIT",
      "thm": "PRESIDENTIAL RESPONSE",
      "rx_kw": "The entry highlights President Widodo's personal visit to the victim's family to offer sympathy.",
      "rx_thm": "The summary focuses on the President's direct engagement and reaction to the protest fatality."
    },
    {
      "rownum": 1602,
      "kw": "MULTI-LOCATION PROTESTS",
      "thm": "WIDESPREAD UNREST",
      "rx_kw": "The entry describes protests occurring simultaneously at several key locations across Jakarta.",
      "rx_thm": "The summary highlights the extensive geographical spread of public disturbances within the city."
    },
    {
      "rownum": 1603,
      "kw": "TRAFFIC JAMS",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry describes a student demonstration that led to significant traffic congestion.",
      "rx_thm": "The summary focuses on the disruption to daily life and public services caused by the ongoing unrest."
    },
    {
      "rownum": 1604,
      "kw": "MRT STATION CLOSURES",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the impact of protests on public transportation services, specifically MRT.",
      "rx_thm": "The summary focuses on the disruption to daily life and public services caused by the ongoing unrest."
    },
    {
      "rownum": 1605,
      "kw": "SURABAYA RIOT",
      "thm": "REGIONAL VIOLENCE",
      "rx_kw": "The entry describes a protest in Surabaya escalating into a violent riot with significant property damage.",
      "rx_thm": "The summary highlights the spread of violent public disturbances to other regions."
    },
    {
      "rownum": 1606,
      "kw": "GPII CALLS FOR PEACE",
      "thm": "NATIONAL STABILITY",
      "rx_kw": "The entry highlights the civil society organization's appeal for public peace and unity.",
      "rx_thm": "The summary focuses on efforts to maintain order and prevent further disruption to national harmony."
    },
    {
      "rownum": 1608,
      "kw": "PRESIDENTIAL COMFORT",
      "thm": "PRESIDENTIAL SUPPORT",
      "rx_kw": "The entry highlights the President's personal visit to offer solace and support to the victim's family.",
      "rx_thm": "The summary focuses on the President's direct engagement and assistance provided to the affected family."
    },
    {
      "rownum": 1610,
      "kw": "PROTEST DISPERSAL",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The entry describes the end of the protest and the subsequent return to normal conditions.",
      "rx_thm": "The summary focuses on the resolution of a public disturbance and the official reactions."
    },
    {
      "rownum": 1612,
      "kw": "REGIONAL POLICE APOLOGY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The entry highlights the apology from a regional police chief and promises of transparency.",
      "rx_thm": "The summary focuses on the police's commitment to responsibility and addressing public demands for reform."
    },
    {
      "rownum": 1613,
      "kw": "SEMARANG PROTEST",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The entry describes the escalation of protests specifically in Semarang, including property damage.",
      "rx_thm": "The summary highlights public disturbances and demands for official changes in a region outside the capital."
    },
    {
      "rownum": 1614,
      "kw": "DPR PROTEST ESCALATION",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes the increase in intensity and aggressive actions during the protest at the DPR building.",
      "rx_thm": "The summary details the escalation of protests into violent confrontations and demands for high-level accountability."
    },
    {
      "rownum": 1615,
      "kw": "BRIMOB MEMBERS DETAINED",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The entry highlights the detention of specific police officers involved in the ojol driver's death.",
      "rx_thm": "The summary focuses on the process of holding individual police officers responsible for their actions."
    },
    {
      "rownum": 1616,
      "kw": "PRESIDENTIAL INTERVENTION",
      "thm": "PRESIDENTIAL DIRECTIVE",
      "rx_kw": "The entry highlights the President's direct involvement, offering aid and issuing directives regarding the incident.",
      "rx_thm": "The summary focuses on the President's actions to support the victim's family, ensure justice, and maintain national order."
    },
    {
      "rownum": 1617,
      "kw": "STUDENT DIALOGUE",
      "thm": "STUDENT ADVOCACY",
      "rx_kw": "The entry highlights the direct communication between student representatives and police officials.",
      "rx_thm": "The summary focuses on the students' efforts to represent their demands and push for justice through engagement."
    },
    {
      "rownum": 1618,
      "kw": "BEM UI LONG MARCH",
      "thm": "STUDENT ACTIVISM",
      "rx_kw": "The entry highlights the organized movement of BEM UI students as a form of protest.",
      "rx_thm": "The summary focuses on the active participation of students in demonstrations against police actions."
    },
    {
      "rownum": 1619,
      "kw": "POLRI SANCTIONS",
      "thm": "INTERNAL DISCIPLINE",
      "rx_kw": "The entry highlights the disciplinary actions taken against police officers for ethical violations.",
      "rx_thm": "The summary focuses on the internal process of holding police personnel accountable for misconduct."
    },
    {
      "rownum": 1621,
      "kw": "STUDENTS BREACH GATES",
      "thm": "PROTEST ESCALATION",
      "rx_kw": "The entry highlights students forcibly entering the police headquarters, signifying an escalation of the protest.",
      "rx_thm": "The summary describes the intensification of the student protest through direct and aggressive actions."
    },
    {
      "rownum": 1624,
      "kw": "ROAD BLOCKAGE",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the protesters' action of obstructing a major road, causing traffic issues.",
      "rx_thm": "The summary focuses on the impact of protests on urban infrastructure and daily life."
    },
    {
      "rownum": 1625,
      "kw": "KAPOLDA MEETS PROTESTERS",
      "thm": "OFFICIAL ENGAGEMENT",
      "rx_kw": "The entry highlights the police chief's direct interaction with the demonstrators.",
      "rx_thm": "The summary focuses on the authorities' efforts to communicate with and address the demands of protesters."
    },
    {
      "rownum": 1627,
      "kw": "TOLL ROAD BLOCKED",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the protesters' action of obstructing a major toll road, causing traffic issues.",
      "rx_thm": "The summary focuses on the impact of protests on urban infrastructure and daily life."
    },
    {
      "rownum": 1629,
      "kw": "SUV FIRE",
      "thm": "PROPERTY DAMAGE",
      "rx_kw": "The entry highlights the burning of a vehicle during the protest.",
      "rx_thm": "The summary focuses on the physical destruction of property as a result of the protest activities."
    },
    {
      "rownum": 1630,
      "kw": "TOLL ROAD CLOSURE",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry highlights the impact of the protest on a major urban infrastructure, the toll road.",
      "rx_thm": "The summary focuses on the disruption to daily life and public services caused by the ongoing unrest."
    },
    {
      "rownum": 1631,
      "kw": "DEMAND FOR NAMES",
      "thm": "POLICE TRANSPARENCY",
      "rx_kw": "The entry highlights the students' specific demand for the full identities of the involved officers.",
      "rx_thm": "The summary focuses on the protesters' call for openness and full disclosure in the police investigation."
    },
    {
      "rownum": 1632,
      "kw": "KAPOLDA PROMISE",
      "thm": "OFFICIAL COMMITMENT",
      "rx_kw": "The entry highlights the police chief's pledge for a transparent investigation with external oversight.",
      "rx_thm": "The summary focuses on the authorities' assurance of openness and thoroughness in addressing the incident."
    },
    {
      "rownum": 1633,
      "kw": "STUDENT PROTEST",
      "thm": "SOCIAL DISRUPTION",
      "rx_kw": "The entry describes a student demonstration that led to significant traffic congestion.",
      "rx_thm": "The summary focuses on the impact of protests on urban infrastructure and daily life."
    },
    {
      "rownum": 1634,
      "kw": "TENSE STANDOFF",
      "thm": "PROTEST CONFRONTATION",
      "rx_kw": "The entry describes a prolonged and hostile encounter between protesters and police.",
      "rx_thm": "The summary focuses on the direct and often violent interactions between law enforcement and demonstrators."
    },
    {
      "rownum": 1635,
      "kw": "HOSTILE PROTEST",
      "thm": "PROTEST CONFRONTATION",
      "rx_kw": "The entry describes an aggressive and confrontational protest directed at the police chief.",
      "rx_thm": "The summary focuses on the direct and often violent interactions between law enforcement and demonstrators."
    },
    {
      "rownum": 1636,
      "kw": "PEACEFUL DEMOCRACY",
      "thm": "PRESIDENTIAL GUIDANCE",
      "rx_kw": "The entry highlights the President's call for orderly and non-violent exercise of democratic rights.",
      "rx_thm": "The summary focuses on the President's advice and directives regarding public conduct during demonstrations."
    },
    {
      "rownum": 1637,
      "kw": "GATHERED PROTESTERS",
      "thm": "PROTEST CONFRONTATION",
      "rx_kw": "The entry describes the renewed assembly of protesters and their aggressive actions.",
      "rx_thm": "The summary focuses on the direct and often violent interactions between law enforcement and demonstrators."
    },
    {
      "rownum": 1638,
      "kw": "WIDESPREAD UNREST",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry describes the extensive spread and intensification of violent protests across multiple locations.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events in the country."
    },
    {
      "rownum": 1639,
      "kw": "BRIMOB SANCTIONS",
      "thm": "INTERNAL DISCIPLINE",
      "rx_kw": "The entry highlights the disciplinary actions taken against Brimob members for ethical violations.",
      "rx_thm": "The summary focuses on the internal process of holding police personnel accountable for misconduct."
    },
    {
      "rownum": 1640,
      "kw": "PERSISTENT STUDENT PROTEST",
      "thm": "DEMANDS FOR JUSTICE",
      "rx_kw": "The entry highlights the ongoing and determined nature of the student protest despite adverse conditions.",
      "rx_thm": "The summary focuses on the continuous public calls for fairness and accountability regarding the ojol driver's death."
    },
    {
      "rownum": 1641,
      "kw": "JAKARTA RIOTS",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry describes violent public disturbances occurring at a key location in Jakarta.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events in the country."
    },
    {
      "rownum": 1642,
      "kw": "MAKO BRIMOB RIOTS",
      "thm": "NATIONAL OVERVIEW",
      "rx_kw": "The entry describes violent public disturbances occurring at a key police headquarters in Jakarta.",
      "rx_thm": "The summary provides a broad snapshot of multiple ongoing issues and events in the country."
    },
    {
      "rownum": 1643,
      "kw": "CHAOTIC PROTEST",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes a disorganized and aggressive protest involving throwing objects and injuring police.",
      "rx_thm": "The summary details the escalation of protests into violent confrontations and property damage."
    },
    {
      "rownum": 1644,
      "kw": "POLICE POST BURNED",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the act of setting fire to a police post and destroying other police property.",
      "rx_thm": "The summary focuses on the extensive physical destruction of property during violent demonstrations."
    },
    {
      "rownum": 1645,
      "kw": "STUDENT PROTEST ESCALATES",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes the increase in intensity and destructive actions during the student protest.",
      "rx_thm": "The summary details the escalation of protests into violent confrontations and property damage."
    },
    {
      "rownum": 1646,
      "kw": "WIDESPREAD VIOLENT PROTESTS",
      "thm": "URBAN UNREST",
      "rx_kw": "The entry describes the extensive spread and intensification of violent protests across multiple locations in Jakarta.",
      "rx_thm": "The summary highlights the widespread public disturbances and aggressive actions occurring throughout the city."
    },
    {
      "rownum": 1650,
      "kw": "PRESIDENTIAL STATEMENT",
      "thm": "PRESIDENTIAL RESPONSE",
      "rx_kw": "The entry highlights the President's detailed and multi-faceted official communication regarding the incident.",
      "rx_thm": "The summary focuses on the President's comprehensive address concerning the public incident and unrest."
    },
    {
      "rownum": 1652,
      "kw": "POLICE STATION ATTACKS",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the repeated and widespread assaults on police facilities.",
      "rx_thm": "The summary details the sustained aggressive and destructive actions taken by protesters against law enforcement infrastructure."
    },
    {
      "rownum": 1653,
      "kw": "SENEN FLYOVER CLASHES",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes violent confrontations and property damage specifically at the Senen Flyover.",
      "rx_thm": "The summary details the escalation of protests into aggressive and destructive acts at a public infrastructure."
    },
    {
      "rownum": 1654,
      "kw": "WIDESPREAD ARSON",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the extensive burning of police vehicles and public facilities across multiple locations.",
      "rx_thm": "The summary focuses on the widespread physical destruction of property during escalating violence."
    },
    {
      "rownum": 1655,
      "kw": "MAKO BRIMOB VIOLENCE",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry describes the escalation of protests into violent acts, including property fires, at the police headquarters.",
      "rx_thm": "The summary details the aggressive and destructive actions taken by protesters against a key police facility."
    },
    {
      "rownum": 1657,
      "kw": "FATHER'S PLEA",
      "thm": "CALL FOR TRUST",
      "rx_kw": "The entry highlights the victim's father's appeal for trust in the police investigation and justice.",
      "rx_thm": "The summary focuses on the family's request for confidence in the authorities to deliver fairness."
    },
    {
      "rownum": 1658,
      "kw": "NO POLICE FATALITIES",
      "thm": "CLARIFICATION",
      "rx_kw": "The entry clarifies that no police officers died during the demonstration, refuting rumors.",
      "rx_thm": "The summary focuses on providing accurate information and dispelling false reports regarding the incident."
    },
    {
      "rownum": 1659,
      "kw": "PRECINCTS ATTACKED",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the widespread assaults and damage inflicted upon multiple police precincts.",
      "rx_thm": "The summary details the aggressive and destructive actions taken by protesters against law enforcement infrastructure."
    },
    {
      "rownum": 1660,
      "kw": "POLICE INJURIES",
      "thm": "PROTEST CASUALTIES",
      "rx_kw": "The entry highlights the number of police officers who sustained injuries during the riot.",
      "rx_thm": "The summary focuses on the human cost and physical harm resulting from the violent demonstrations."
    },
    {
      "rownum": 1661,
      "kw": "REGIONAL CHIEF HIT",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the direct assault on a high-ranking police official during the protest.",
      "rx_thm": "The summary details the aggressive and dangerous actions taken by protesters against law enforcement."
    },
    {
      "rownum": 1662,
      "kw": "JAMBI PROTEST VIOLENCE",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The entry describes a violent protest in Jambi resulting in injuries and property damage.",
      "rx_thm": "The summary highlights public disturbances and aggressive actions in a region outside the capital."
    },
    {
      "rownum": 1664,
      "kw": "DPR APOLOGY",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The entry highlights the DPR's expression of regret for the protest violence and commitment to investigation.",
      "rx_thm": "The summary details the official statements and actions from the legislative body in response to the unrest."
    },
    {
      "rownum": 1665,
      "kw": "POLRI REFORM CALL",
      "thm": "INSTITUTIONAL REFORM",
      "rx_kw": "The entry highlights the call from Tepi Indonesia for structural changes within the police institution.",
      "rx_thm": "The summary focuses on demands for fundamental changes in the organization and oversight of law enforcement."
    },
    {
      "rownum": 1666,
      "kw": "POLICE VEHICLES ABLAZE",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the burning of police vehicles by a mob using Molotov cocktails.",
      "rx_thm": "The summary focuses on the extensive physical destruction of property during violent attacks on police facilities."
    },
    {
      "rownum": 1667,
      "kw": "RIAU PROTEST",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The entry describes a large protest specifically occurring at the Riau Regional Police Headquarters.",
      "rx_thm": "The summary highlights public disturbances and demands for official changes in a region outside the capital."
    },
    {
      "rownum": 1670,
      "kw": "VEHICLES DESTROYED",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the extensive damage and destruction of multiple vehicles at a police station.",
      "rx_thm": "The summary focuses on the widespread physical destruction of property during violent attacks."
    },
    {
      "rownum": 1671,
      "kw": "MAKASSAR ARSON",
      "thm": "REGIONAL VIOLENCE",
      "rx_kw": "The entry highlights the burning of multiple public facilities during violent protests in Makassar.",
      "rx_thm": "The summary describes the escalation of regional protests into destructive and violent acts."
    },
    {
      "rownum": 1673,
      "kw": "JOKOWI CONDOLENCES",
      "thm": "HIGH-LEVEL RESPONSE",
      "rx_kw": "The entry highlights the expression of sympathy from the former President regarding the tragic death.",
      "rx_thm": "The summary focuses on the reactions and actions taken by prominent national figures in response to the incident."
    },
    {
      "rownum": 1674,
      "kw": "OFFICER INJURED",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The entry highlights the injury sustained by a police officer during the violent protest.",
      "rx_thm": "The summary details the aggressive and dangerous actions taken by protesters against law enforcement."
    },
    {
      "rownum": 1675,
      "kw": "MUHAMMADIYAH CALL",
      "thm": "CALL FOR UNITY",
      "rx_kw": "The entry highlights the religious organization's appeal for peace, restraint, and national cohesion.",
      "rx_thm": "The summary focuses on the plea from a prominent religious body for social harmony and peaceful resolution."
    },
    {
      "rownum": 1676,
      "kw": "BUS STOP ABLAZE",
      "thm": "PROPERTY DAMAGE",
      "rx_kw": "The entry highlights the act of setting fire to a public transportation facility.",
      "rx_thm": "The summary focuses on the physical destruction of public property during violent clashes."
    },
    {
      "rownum": 1677,
      "kw": "PRESIDENTS RESPOND",
      "thm": "PRESIDENTIAL CONCERN",
      "rx_kw": "The entry highlights the reactions and actions of both the current and former presidents regarding the incident.",
      "rx_thm": "The summary focuses on the high-level attention and concern from the nation's leaders amidst the unrest."
    },
    {
      "rownum": 1682,
      "kw": "SRI SULTAN MEETS",
      "thm": "REGIONAL LEADERSHIP",
      "rx_kw": "The entry highlights the meeting between the regional leader and protesters, urging peace.",
      "rx_thm": "The summary focuses on the involvement of a regional authority figure in addressing public unrest and demands."
    },
    {
      "rownum": 1683,
      "kw": "FAMILY DEMANDS JUSTICE",
      "thm": "PUBLIC GRIEVANCES",
      "rx_kw": "The entry highlights the victim's family's call for fairness and accountability.",
      "rx_thm": "The summary focuses on the underlying public dissatisfaction and anger over socio-economic issues."
    },
    {
      "rownum": 1684,
      "kw": "CONTINUED UNREST",
      "thm": "URBAN UNREST",
      "rx_kw": "The entry highlights the persistence of public disturbances and attacks at the police headquarters.",
      "rx_thm": "The summary focuses on the ongoing public disturbances and aggressive actions occurring in the city."
    },
    {
      "rownum": 1685,
      "kw": "PUBLIC FACILITIES BURNED",
      "thm": "PROPERTY DESTRUCTION",
      "rx_kw": "The entry highlights the burning of multiple public facilities, including bus stops and a toll gate.",
      "rx_thm": "The summary focuses on the extensive physical destruction of public property during violent demonstrations."
    },
    {
      "rownum": 1687,
      "kw": "PROTEST AFTERMATH",
      "thm": "AFTERMATH OF UNREST",
      "rx_kw": "The entry describes the consequences and cleanup efforts following the dispersal of protesters.",
      "rx_thm": "The summary focuses on the resolution of a public disturbance and the lingering effects, including property damage."
    },
    {
      "rownum": 1690,
      "kw": "SEMARANG ARSON",
      "thm": "REGIONAL VIOLENCE",
      "rx_kw": "The entry highlights the burning of multiple vehicles during escalating protests in Semarang.",
      "rx_thm": "The summary describes the escalation of regional protests into destructive and violent acts."
    },
    {
      "rownum": 1692,
      "kw": "FATHER'S PLEA",
      "thm": "CALL FOR TRUST",
      "rx_kw": "The entry highlights the victim's father's appeal for calm and trust in the police investigation.",
      "rx_thm": "The summary focuses on the family's request for confidence in the authorities to deliver fairness."
    }
  ],
  "2025-08-30": [
    {
      "rownum": 1693,
      "kw": "SULTAN INTERVENTION",
      "thm": "DE-ESCALATION",
      "rx_kw": "The Sultan's direct involvement in calming the protest and engaging with demonstrators is the central action.",
      "rx_thm": "The Sultan's actions, including dialogue and securing releases, aimed to reduce tension and achieve a peaceful outcome."
    },
    {
      "rownum": 1695,
      "kw": "MRT VANDALISM",
      "thm": "PUBLIC TRANSPORT DISRUPTION",
      "rx_kw": "The core issue is the damage inflicted upon MRT facilities during protests.",
      "rx_thm": "The vandalism directly led to the halting of MRT operations, impacting public mobility."
    },
    {
      "rownum": 1696,
      "kw": "SULTAN DIALOGUE",
      "thm": "CONFLICT RESOLUTION",
      "rx_kw": "The Sultan's direct engagement and offer to facilitate dialogue are the key actions.",
      "rx_thm": "The Sultan's efforts aimed to resolve the protest peacefully through communication and mediation."
    },
    {
      "rownum": 1697,
      "kw": "MRT CLOSURES",
      "thm": "PUBLIC TRANSPORT DISRUPTION",
      "rx_kw": "The primary impact highlighted is the closure of MRT stations due to protests.",
      "rx_thm": "The unrest directly caused the cessation of public transport services, affecting commuters."
    },
    {
      "rownum": 1700,
      "kw": "POLICE STATION ATTACK",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary details the burning of a police station gate and motorcycles during a disturbance.",
      "rx_thm": "The disturbance involved destructive acts against public facilities, indicating violent protest behavior."
    },
    {
      "rownum": 1702,
      "kw": "URBAN UNREST",
      "thm": "WIDESPREAD DESTRUCTION",
      "rx_kw": "The summary describes ongoing, escalating protests with clashes and significant damage across Jakarta.",
      "rx_thm": "The protests resulted in extensive burning and damage to multiple public facilities and infrastructure."
    },
    {
      "rownum": 1703,
      "kw": "POLICE INJURIES",
      "thm": "PROTEST CASUALTIES",
      "rx_kw": "The central focus is on the injuries sustained by police officers during the riot.",
      "rx_thm": "The violent nature of the protests led to physical harm and injuries among law enforcement personnel."
    },
    {
      "rownum": 1704,
      "kw": "GOVERNOR URGES CALM",
      "thm": "REGIONAL RESPONSE",
      "rx_kw": "The governor's primary action is urging calm and addressing the aftermath of the protest.",
      "rx_thm": "The entry describes the official reaction and measures taken by a regional government leader following unrest."
    },
    {
      "rownum": 1705,
      "kw": "AFFAN KURNIAWAN DEATH",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The death of the ojol driver is the catalyst for widespread protests and government response.",
      "rx_thm": "The government's and police chief's response focuses on investigating and punishing those responsible for the death."
    },
    {
      "rownum": 1706,
      "kw": "POLICE INVESTIGATION",
      "thm": "TRANSPARENCY AND JUSTICE",
      "rx_kw": "The core action is the police internal affairs investigating the death of the ojol driver.",
      "rx_thm": "The investigation and ethical proceedings are highlighted for their transparency and pursuit of justice."
    },
    {
      "rownum": 1707,
      "kw": "GOVERNOR DE-ESCALATION",
      "thm": "REGIONAL STABILITY",
      "rx_kw": "The governor's actions are focused on calming the situation and preventing further escalation.",
      "rx_thm": "The governor's intervention aims to restore and maintain peace and order in the region."
    },
    {
      "rownum": 1708,
      "kw": "BRIMOB HQ CLASHES",
      "thm": "ONGOING UNREST",
      "rx_kw": "The summary describes persistent violent confrontations near the Brimob headquarters.",
      "rx_thm": "The situation indicates a prolonged period of public disorder and conflict."
    },
    {
      "rownum": 1709,
      "kw": "POLICE STATION ARSON",
      "thm": "TARGETED VIOLENCE",
      "rx_kw": "The primary event is the deliberate burning and attack on a police station.",
      "rx_thm": "The violence is specifically directed at law enforcement facilities, indicating a targeted attack."
    },
    {
      "rownum": 1711,
      "kw": "POLICE STATION BURNING",
      "thm": "MOB VIOLENCE",
      "rx_kw": "The central event is the attack and burning of police stations by a mob.",
      "rx_thm": "The destruction is caused by a large, uncontrolled group acting violently."
    },
    {
      "rownum": 1714,
      "kw": "BANDUNG DAMAGE",
      "thm": "POST-PROTEST RECOVERY",
      "rx_kw": "The summary focuses on the aftermath and destruction caused by the demonstration in Bandung.",
      "rx_thm": "The entry describes the cleanup and return to normalcy after the violent protests."
    },
    {
      "rownum": 1715,
      "kw": "POLICE FACILITY DAMAGE",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The core information is the severe damage inflicted upon police facilities.",
      "rx_thm": "The protests directly led to significant physical destruction of infrastructure."
    },
    {
      "rownum": 1717,
      "kw": "SEMARANG RIOT",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The summary describes a violent protest in Semarang with widespread consequences.",
      "rx_thm": "The unrest is not confined to one city but has spread across a broader geographical area."
    },
    {
      "rownum": 1719,
      "kw": "MULTIPLE POLICE ATTACKS",
      "thm": "WIDESPREAD VIOLENCE",
      "rx_kw": "The entry highlights attacks on numerous police facilities across East Jakarta.",
      "rx_thm": "The violence is extensive, affecting multiple locations and causing significant damage."
    },
    {
      "rownum": 1721,
      "kw": "SURABAYA RIOT AFTERMATH",
      "thm": "POST-UNREST NORMALIZATION",
      "rx_kw": "The summary focuses on the consequences of the riots and the city's return to order.",
      "rx_thm": "The entry describes the process of a city recovering and returning to its normal state after civil disturbance."
    },
    {
      "rownum": 1723,
      "kw": "PUBLIC FACILITY VANDALISM",
      "thm": "POST-PROTEST CLEANUP",
      "rx_kw": "The core event is the destruction and damage of public infrastructure.",
      "rx_thm": "The focus is on the efforts to clear debris and restore order after the protests."
    },
    {
      "rownum": 1725,
      "kw": "AFFAN KURNIAWAN DEATH",
      "thm": "PROTEST CATALYST",
      "rx_kw": "The death of the ojol driver is explicitly stated as triggering further protests.",
      "rx_thm": "The incident served as the primary cause and escalation point for subsequent demonstrations."
    },
    {
      "rownum": 1728,
      "kw": "BUSES BURNED",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The key event is the burning of public transport vehicles and infrastructure.",
      "rx_thm": "The protests resulted in significant physical damage and destruction of property."
    },
    {
      "rownum": 1730,
      "kw": "MUI CALLS FOR CALM",
      "thm": "NATIONAL UNITY APPEAL",
      "rx_kw": "The religious council's primary action is issuing a plea for peace and restraint.",
      "rx_thm": "The appeal emphasizes maintaining cohesion and avoiding division during a tense period."
    },
    {
      "rownum": 1731,
      "kw": "SEMARANG ARRESTS",
      "thm": "POLICE INTERVENTION",
      "rx_kw": "The central event is the apprehension of numerous individuals during a protest.",
      "rx_thm": "The police actively engaged to control and disperse a chaotic demonstration."
    },
    {
      "rownum": 1732,
      "kw": "DEPOK POLICE ATTACKED",
      "thm": "REGIONAL SPILLOVER",
      "rx_kw": "The summary details attacks on police facilities in Depok.",
      "rx_thm": "The violence in Depok is explicitly linked to the larger demonstrations in Jakarta, showing spread."
    },
    {
      "rownum": 1733,
      "kw": "PUBLIC ANGER",
      "thm": "SOCIO-ECONOMIC GRIEVANCES",
      "rx_kw": "The summary identifies public anger as the driving force behind the demonstrations.",
      "rx_thm": "The protests are rooted in dissatisfaction with economic conditions and political decisions."
    },
    {
      "rownum": 1734,
      "kw": "JUSTICE FOR AFFAN",
      "thm": "PUBLIC OUTCRY",
      "rx_kw": "The central demand is for fairness and accountability regarding Affan Kurniawan's death.",
      "rx_thm": "The death triggered widespread public emotional response and demands for change."
    },
    {
      "rownum": 1735,
      "kw": "POLICE CHIEF DISMISSAL",
      "thm": "POLICE REFORM DEMANDS",
      "rx_kw": "The core demand is for the removal of the National Police Chief.",
      "rx_thm": "The calls for dismissal are part of broader demands for systemic changes within the police force."
    },
    {
      "rownum": 1736,
      "kw": "KAPOLRI RESPONSE",
      "thm": "DE-ESCALATION STRATEGY",
      "rx_kw": "The summary focuses on the National Police Chief's actions and statements following the incident.",
      "rx_thm": "The police chief's actions are aimed at calming public anger and preventing further violence."
    },
    {
      "rownum": 1738,
      "kw": "BANDUNG DAMAGE ASSESSMENT",
      "thm": "POST-PROTEST RECOVERY",
      "rx_kw": "The mayor's action involves evaluating the widespread destruction caused by the protest.",
      "rx_thm": "The focus is on assessing the aftermath and planning for the restoration of damaged infrastructure."
    },
    {
      "rownum": 1739,
      "kw": "POLICE BUDGET CRITICISM",
      "thm": "ACCOUNTABILITY DEMANDS",
      "rx_kw": "The core of the entry is the criticism directed at police spending and budget requests.",
      "rx_thm": "The criticism is linked to demands for greater responsibility and oversight of police actions and finances."
    },
    {
      "rownum": 1740,
      "kw": "BANDUNG RUINS",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The summary highlights the extensive damage and destruction left in Bandung.",
      "rx_thm": "The entry describes the physical devastation caused by the public unrest."
    },
    {
      "rownum": 1741,
      "kw": "JAKARTA ESCALATION",
      "thm": "WIDESPREAD UNREST",
      "rx_kw": "The summary describes the protests intensifying into widespread destruction and violence.",
      "rx_thm": "The situation involves extensive public disorder and conflict across the city."
    },
    {
      "rownum": 1743,
      "kw": "EAST JAKARTA POLICE ATTACK",
      "thm": "TARGETED VIOLENCE",
      "rx_kw": "The core event is the attack and damage inflicted upon police facilities in East Jakarta.",
      "rx_thm": "The violence is specifically directed at law enforcement infrastructure."
    },
    {
      "rownum": 1748,
      "kw": "WIDESPREAD DAMAGE",
      "thm": "NATIONAL IMPACT",
      "rx_kw": "The summary emphasizes the extensive destruction across multiple cities.",
      "rx_thm": "The protests have broad consequences affecting infrastructure, economy, and national security."
    },
    {
      "rownum": 1749,
      "kw": "SEMARANG ARRESTS RELEASE",
      "thm": "POST-PROTEST RESPONSE",
      "rx_kw": "The key action is the release of arrested demonstrators in Semarang.",
      "rx_thm": "The entry describes the official actions taken after the protest, including releases and calls for calm."
    },
    {
      "rownum": 1750,
      "kw": "EAST JAKARTA POLICE ARSON",
      "thm": "TARGETED DESTRUCTION",
      "rx_kw": "The summary details the burning of police stations and vehicles in East Jakarta.",
      "rx_thm": "The destruction is specifically aimed at law enforcement facilities."
    },
    {
      "rownum": 1752,
      "kw": "PROTEST TRIGGERS",
      "thm": "GOVERNMENT RESPONSIBILITY",
      "rx_kw": "The expert identifies underlying causes that ignite public demonstrations.",
      "rx_thm": "The advice is directed at the government to address root causes and manage protests effectively."
    },
    {
      "rownum": 1755,
      "kw": "SULTAN CALMS PROTEST",
      "thm": "DE-ESCALATION",
      "rx_kw": "The Sultan's direct intervention to pacify a tense protest is the central action.",
      "rx_thm": "The Sultan's actions are aimed at reducing tension and preventing further violence."
    },
    {
      "rownum": 1756,
      "kw": "SULTAN INTERVENTION",
      "thm": "LEADERSHIP RESPONSE",
      "rx_kw": "The Sultan's personal involvement to calm and disperse the crowd is the key event.",
      "rx_thm": "The entry highlights the direct action taken by a prominent leader in response to public demonstrations."
    },
    {
      "rownum": 1758,
      "kw": "KADIN ECONOMIC STABILITY",
      "thm": "ECONOMIC CONCERN",
      "rx_kw": "The Kadin Chairman's statement focuses on maintaining economic stability amidst protests.",
      "rx_thm": "The primary concern expressed is the potential negative impact of unrest on the economy."
    },
    {
      "rownum": 1759,
      "kw": "MAKASSAR DPRD FIRE",
      "thm": "PROTEST FATALITIES",
      "rx_kw": "The central event is the fire at the DPRD building and the resulting deaths.",
      "rx_thm": "The entry highlights the loss of life directly caused by the demonstrations."
    },
    {
      "rownum": 1760,
      "kw": "TRADE MINISTER APPEAL",
      "thm": "ECONOMIC STABILITY",
      "rx_kw": "The Trade Minister's action is to reassure the public and prevent economic disruption.",
      "rx_thm": "The appeal aims to maintain a steady supply of goods and prevent market panic during unrest."
    },
    {
      "rownum": 1761,
      "kw": "FREE PUBLIC TRANSPORT",
      "thm": "URBAN RECOVERY",
      "rx_kw": "The key measure is providing free public transportation after the protests.",
      "rx_thm": "The actions are aimed at restoring city services and mobility after the unrest."
    },
    {
      "rownum": 1762,
      "kw": "POLRI DUTIES CRITICISM",
      "thm": "POLICE REFORM",
      "rx_kw": "The criticism focuses on the police force's operational scope and effectiveness.",
      "rx_thm": "The call is for a re-evaluation and restructuring of police responsibilities and professionalism."
    },
    {
      "rownum": 1763,
      "kw": "WEST JAVA ALERT",
      "thm": "REGIONAL SECURITY",
      "rx_kw": "The police in West Java declared a high alert due to widespread protests.",
      "rx_thm": "The focus is on maintaining order and safety across the region during unrest."
    },
    {
      "rownum": 1764,
      "kw": "PRESIDENTIAL DIRECTIVE",
      "thm": "LAW AND ORDER",
      "rx_kw": "The President issued a clear command for strong action against violent protests.",
      "rx_thm": "The directive emphasizes upholding legal boundaries and maintaining public peace."
    },
    {
      "rownum": 1766,
      "kw": "POLICE CHIEF DISMISSAL",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The core demand is for the removal of the National Police Chief due to alleged brutality.",
      "rx_thm": "The demand highlights the need for the police force to be held responsible for its actions."
    },
    {
      "rownum": 1767,
      "kw": "MUHAMMADIYAH APPEAL",
      "thm": "NATIONAL UNITY",
      "rx_kw": "The religious organization issued a call for justice, order, and national cohesion.",
      "rx_thm": "The appeal emphasizes the importance of solidarity and peace during a period of unrest."
    },
    {
      "rownum": 1769,
      "kw": "FREE TRANSJAKARTA",
      "thm": "POST-PROTEST RECOVERY",
      "rx_kw": "The governor announced a measure to provide free public transport after protest damage.",
      "rx_thm": "The actions are aimed at restoring city services and public confidence after the unrest."
    },
    {
      "rownum": 1770,
      "kw": "CIREBON PROTEST VIOLENCE",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The summary describes the escalation of a protest in Cirebon into violent acts.",
      "rx_thm": "The entry highlights widespread public disorder and conflict in a specific region."
    },
    {
      "rownum": 1772,
      "kw": "JAKARTA ANARCHY",
      "thm": "PROTEST ESCALATION",
      "rx_kw": "The protests in Jakarta are described as turning anarchic, leading to widespread destruction.",
      "rx_thm": "The situation indicates a significant increase in the intensity and destructiveness of the demonstrations."
    },
    {
      "rownum": 1773,
      "kw": "BRIMOB ETHICAL TRIAL",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The core event is the assurance of a transparent ethical trial for the involved police personnel.",
      "rx_thm": "The focus is on holding police officers responsible for their actions through a legal process."
    },
    {
      "rownum": 1774,
      "kw": "POLICE LEGAL ACTION",
      "thm": "JUSTICE AND TRANSPARENCY",
      "rx_kw": "The police chief is expediting legal proceedings against officers involved in a death.",
      "rx_thm": "The actions aim to ensure fairness and openness in the investigation and legal process."
    },
    {
      "rownum": 1776,
      "kw": "JAKARTA SAFETY SIGNAL",
      "thm": "RESTORING CONFIDENCE",
      "rx_kw": "The governor's decision aims to convey that Jakarta is safe after the protests.",
      "rx_thm": "The action is intended to rebuild public trust and a sense of security in the city."
    },
    {
      "rownum": 1777,
      "kw": "TNI-POLRI FIRM ACTION",
      "thm": "RESTORING PUBLIC ORDER",
      "rx_kw": "The military and police chiefs announced a strong, controlled response to restore security.",
      "rx_thm": "The primary goal is to re-establish peace and control after widespread unrest."
    },
    {
      "rownum": 1778,
      "kw": "PUBLIC FACILITY REPAIRS",
      "thm": "URBAN RECOVERY",
      "rx_kw": "The governor ordered prompt restoration of damaged public infrastructure.",
      "rx_thm": "The focus is on repairing and bringing city services back to normal after the protests."
    },
    {
      "rownum": 1779,
      "kw": "POLICE CHIEF URGES CALM",
      "thm": "SECURITY RESTORATION",
      "rx_kw": "The police chief's primary message is a call for peace and support for security efforts.",
      "rx_thm": "The objective is to re-establish peace and order across the affected cities."
    },
    {
      "rownum": 1783,
      "kw": "VP MISINFORMATION",
      "thm": "DEBUNKING RUMORS",
      "rx_kw": "The core of the entry is the denial of false information about the Vice President.",
      "rx_thm": "The action aims to correct and prevent the spread of misleading information during a sensitive time."
    },
    {
      "rownum": 1785,
      "kw": "JAKARTA CLEANUP",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The governor ordered an accelerated effort to clear debris and restore the city.",
      "rx_thm": "The focus is on rapidly bringing the capital back to normal after the demonstrations."
    },
    {
      "rownum": 1787,
      "kw": "PRESIDENTIAL ORDER",
      "thm": "LAW AND ORDER",
      "rx_kw": "The President issued a direct command for strong measures against violent protests.",
      "rx_thm": "The directive aims to enforce legal boundaries and restore public peace and control."
    },
    {
      "rownum": 1789,
      "kw": "GIBRAN MISINFORMATION",
      "thm": "DEBUNKING RUMORS",
      "rx_kw": "The core of the entry is the refutation of false information about Gibran.",
      "rx_thm": "The action aims to correct and prevent the spread of misleading information during a sensitive time."
    },
    {
      "rownum": 1791,
      "kw": "LEADERS URGE CALM",
      "thm": "DE-ESCALATION APPEAL",
      "rx_kw": "Religious and community leaders are calling for peace and caution during protests.",
      "rx_thm": "The appeal aims to prevent the protests from becoming more violent or widespread."
    },
    {
      "rownum": 1793,
      "kw": "POLRI FIRM ACTION",
      "thm": "MAINTAINING PUBLIC ORDER",
      "rx_kw": "The police chief affirmed a strong stance against destructive protest behavior.",
      "rx_thm": "The statement emphasizes enforcing laws to ensure peace and safety during demonstrations."
    },
    {
      "rownum": 1794,
      "kw": "DEPOK BRIMOB RIOT",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary describes a violent confrontation at the Brimob headquarters in Depok.",
      "rx_thm": "The event involves destructive and aggressive behavior by a protesting crowd."
    },
    {
      "rownum": 1795,
      "kw": "SOLO CITIZEN TASK FORCE",
      "thm": "COMMUNITY SECURITY",
      "rx_kw": "The mayor initiated community-led groups to address and prevent anarchist acts.",
      "rx_thm": "The focus is on local residents actively participating in maintaining peace and order."
    },
    {
      "rownum": 1797,
      "kw": "DEPOK POLICE POSTS BURNED",
      "thm": "REGIONAL SPILLOVER",
      "rx_kw": "The core event is the destruction of police posts in Depok by unknown attackers.",
      "rx_thm": "The attacks are linked to broader protests, indicating the spread of unrest beyond Jakarta."
    },
    {
      "rownum": 1798,
      "kw": "BALI PROTEST ARRESTS",
      "thm": "LAW ENFORCEMENT ACTION",
      "rx_kw": "The key event is the apprehension of demonstrators in Bali for causing damage.",
      "rx_thm": "The police took legal measures to address violent and destructive protest behavior."
    },
    {
      "rownum": 1799,
      "kw": "PRESIDENTIAL DIALOGUE",
      "thm": "NATIONAL UNITY",
      "rx_kw": "The President engaged in discussions with various leaders to promote peace and unity.",
      "rx_thm": "The meeting's objective is to foster cohesion and stability across the nation."
    },
    {
      "rownum": 1800,
      "kw": "LAWFUL PROTESTS",
      "thm": "BALANCING RIGHTS",
      "rx_kw": "The police chief emphasized the importance of protests adhering to legal boundaries.",
      "rx_thm": "The statement highlights the need to reconcile freedom of expression with public safety and order."
    },
    {
      "rownum": 1802,
      "kw": "PRESIDENT MEETS RELIGIOUS LEADERS",
      "thm": "NATIONAL UNITY",
      "rx_kw": "The President held a meeting with religious leaders to discuss national peace and stability.",
      "rx_thm": "The dialogue aims to foster cohesion and collective efforts to maintain peace in the country."
    },
    {
      "rownum": 1808,
      "kw": "CIANJUR PROTEST CLASHES",
      "thm": "REGIONAL VIOLENCE",
      "rx_kw": "The summary describes a protest in Cianjur escalating into violent confrontations with police.",
      "rx_thm": "The event highlights public disorder and aggressive behavior in a specific region."
    },
    {
      "rownum": 1812,
      "kw": "JAKARTA RECOVERY PLAN",
      "thm": "URBAN RESTORATION",
      "rx_kw": "The governor outlined measures for the city's return to normalcy and repair of damages.",
      "rx_thm": "The focus is on restoring public services and infrastructure after the protests."
    },
    {
      "rownum": 1814,
      "kw": "KEDIRI DPRD BURNED",
      "thm": "REGIONAL DESTRUCTION",
      "rx_kw": "The central event is the burning and damage of the DPRD building in Kediri.",
      "rx_thm": "The protest resulted in significant physical destruction of government property in the region."
    },
    {
      "rownum": 1815,
      "kw": "TUBAN OJOL SOLIDARITY",
      "thm": "JUSTICE DEMANDS",
      "rx_kw": "Online taxi drivers in Tuban expressed support and called for an investigation into Affan's death.",
      "rx_thm": "The action reflects a collective call for fairness and accountability regarding the incident."
    },
    {
      "rownum": 1817,
      "kw": "BALI PROTEST INJURIES",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary highlights the physical harm sustained by individuals during the Bali protest.",
      "rx_thm": "The protest involved aggressive actions leading to physical casualties and arrests."
    },
    {
      "rownum": 1818,
      "kw": "GOVERNOR AIDS VICTIMS",
      "thm": "POST-PROTEST SUPPORT",
      "rx_kw": "The governor's action is to provide assistance to those affected by the protest.",
      "rx_thm": "The focus is on providing help and relief to individuals impacted by the unrest."
    },
    {
      "rownum": 1820,
      "kw": "POLRI FIRM ACTION",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The police force, with military support, will take strong measures against violent acts.",
      "rx_thm": "The focus is on the role of security forces in maintaining order and safety."
    },
    {
      "rownum": 1821,
      "kw": "YOGYAKARTA POLICE VANDALISM",
      "thm": "PROTEST DESTRUCTION",
      "rx_kw": "The summary details the damage and arson inflicted upon the police headquarters in Yogyakarta.",
      "rx_thm": "The protest resulted in significant physical damage and destruction of property."
    },
    {
      "rownum": 1822,
      "kw": "GOVERNOR URGES PEACE",
      "thm": "DE-ESCALATION",
      "rx_kw": "The governor met protesters to encourage peaceful conduct and prevent violence.",
      "rx_thm": "The leadership's action aims to reduce tension and promote calm during demonstrations."
    },
    {
      "rownum": 1824,
      "kw": "KEDIRI DPRD BURNED",
      "thm": "REGIONAL DESTRUCTION",
      "rx_kw": "The central event is the burning and destruction of the DPRD building in Kediri.",
      "rx_thm": "The protest resulted in significant physical destruction of government property in the region."
    },
    {
      "rownum": 1825,
      "kw": "POLRI FIRM ACTION",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The police force, with military support, will take strong measures against violent acts.",
      "rx_thm": "The focus is on the role of security forces in maintaining order and safety."
    },
    {
      "rownum": 1827,
      "kw": "KADIN CALL FOR CALM",
      "thm": "ECONOMIC STABILITY",
      "rx_kw": "The Kadin Chairman's statement focuses on promoting peace for economic reasons.",
      "rx_thm": "The primary concern expressed is the potential negative impact of unrest on the economy."
    },
    {
      "rownum": 1828,
      "kw": "PRESIDENT CANCELS VISIT",
      "thm": "DOMESTIC FOCUS",
      "rx_kw": "The President's decision to cancel international travel highlights a shift in priorities.",
      "rx_thm": "The cancellation indicates a strong emphasis on addressing internal national issues."
    },
    {
      "rownum": 1829,
      "kw": "PRESIDENT POSTPONES VISIT",
      "thm": "DOMESTIC UNREST IMPACT",
      "rx_kw": "The President's decision to postpone travel is directly linked to internal unrest.",
      "rx_thm": "The widespread protests are significantly affecting the President's international agenda."
    },
    {
      "rownum": 1830,
      "kw": "TNI-POLRI FIRM ACTION",
      "thm": "RESTORING PUBLIC ORDER",
      "rx_kw": "The police chief announced a strong, coordinated response by security forces.",
      "rx_thm": "The primary goal is to re-establish peace and control after widespread unrest."
    },
    {
      "rownum": 1831,
      "kw": "MAKASSAR DPRD FIRE",
      "thm": "PROTEST FATALITIES",
      "rx_kw": "The central event is the fire at the DPRD building and the resulting deaths.",
      "rx_thm": "The entry highlights the loss of life directly caused by the demonstrations."
    },
    {
      "rownum": 1832,
      "kw": "PEKALONGAN DPRD BURNED",
      "thm": "ANARCHIC DESTRUCTION",
      "rx_kw": "The core event is the burning and vandalism of the DPRD building in Pekalongan.",
      "rx_thm": "The protest involved uncontrolled and destructive acts against government property."
    },
    {
      "rownum": 1835,
      "kw": "PRESIDENT CANCELS VISIT",
      "thm": "DOMESTIC FOCUS",
      "rx_kw": "The President's decision to cancel international travel highlights a shift in priorities.",
      "rx_thm": "The cancellation indicates a strong emphasis on addressing internal national issues."
    },
    {
      "rownum": 1837,
      "kw": "PEACEFUL PROTEST HANDLING",
      "thm": "PUBLIC SAFETY",
      "rx_kw": "The faction advocates for managing demonstrations without causing harm or casualties.",
      "rx_thm": "The primary concern is ensuring the well-being and security of the public during protests."
    },
    {
      "rownum": 1838,
      "kw": "POLITICIAN HOUSE LOOTED",
      "thm": "TARGETED MOB VIOLENCE",
      "rx_kw": "The core event is the ransacking and theft at a politician's residence by a mob.",
      "rx_thm": "The violence is specifically directed at the property of a political figure."
    },
    {
      "rownum": 1839,
      "kw": "PRESIDENTIAL ORDER",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The President issued a direct command for strong measures against violent protests.",
      "rx_thm": "The directive emphasizes enforcing legal boundaries and maintaining public order."
    },
    {
      "rownum": 1840,
      "kw": "BALI PROTEST VIOLENCE",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The summary describes a protest in Bali escalating into violent acts and injuries.",
      "rx_thm": "The entry highlights public disorder and aggressive behavior in a specific region."
    },
    {
      "rownum": 1843,
      "kw": "AFFAN DEATH INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "The police chief ordered a rapid and thorough inquiry into the ojol driver's death.",
      "rx_thm": "The focus is on holding police officers responsible for their actions through a legal process."
    },
    {
      "rownum": 1844,
      "kw": "POLITICIAN HOUSE LOOTED",
      "thm": "TARGETED MOB VIOLENCE",
      "rx_kw": "The core event is the ransacking and theft at a politician's residence by a mob.",
      "rx_thm": "The violence is specifically directed at the property of a political figure."
    },
    {
      "rownum": 1845,
      "kw": "CENTRAL JAVA POLICE ATTACK",
      "thm": "ANARCHIC VIOLENCE",
      "rx_kw": "The summary details an attack on the regional police headquarters by an anarchist group.",
      "rx_thm": "The event involves uncontrolled and destructive acts against law enforcement."
    },
    {
      "rownum": 1846,
      "kw": "PRESIDENTIAL DIRECTIVE",
      "thm": "CRACKDOWN ON ANARCHY",
      "rx_kw": "The President issued a clear command for strong action against violent protests.",
      "rx_thm": "The directive emphasizes suppressing destructive and unlawful protest behavior."
    },
    {
      "rownum": 1847,
      "kw": "SURABAYA GRAHADI FIRE",
      "thm": "POST-DIALOGUE VIOLENCE",
      "rx_kw": "The central event is the burning of a government building in Surabaya after a meeting.",
      "rx_thm": "The violence occurred despite or immediately after an attempt at dialogue with officials."
    },
    {
      "rownum": 1848,
      "kw": "EAST JAKARTA POLICE ATTACKS",
      "thm": "WIDESPREAD DESTRUCTION",
      "rx_kw": "The summary details attacks on multiple police facilities in East Jakarta.",
      "rx_thm": "The attacks resulted in extensive damage and destruction across several locations."
    },
    {
      "rownum": 1851,
      "kw": "POLICE WARNING",
      "thm": "LAWFUL PROTESTS",
      "rx_kw": "The police chief issued a caution against unlawful and destructive protest behavior.",
      "rx_thm": "The statement emphasizes the importance of adhering to legal boundaries during demonstrations."
    },
    {
      "rownum": 1852,
      "kw": "PRESIDENTIAL EVALUATION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The President convened a meeting to assess the widespread unrest and its causes.",
      "rx_thm": "The government is actively reviewing the situation and planning its course of action."
    },
    {
      "rownum": 1853,
      "kw": "GOVERNOR INSPECTS DAMAGE",
      "thm": "POST-PROTEST RECOVERY",
      "rx_kw": "The governor personally surveyed the areas affected by the riots and ordered cleanup.",
      "rx_thm": "The focus is on assessing the aftermath and planning for the restoration of damaged infrastructure."
    },
    {
      "rownum": 1857,
      "kw": "LUMAJANG OJOL SOLIDARITY",
      "thm": "CALL FOR JUSTICE",
      "rx_kw": "Online taxi drivers in Lumajang expressed collective support and grief for Affan.",
      "rx_thm": "The action reflects a collective demand for fairness and accountability regarding the incident."
    },
    {
      "rownum": 1859,
      "kw": "GOVERNOR CRISIS MANAGEMENT",
      "thm": "STRATEGIC RESPONSE",
      "rx_kw": "The governor described his indirect, coordinated method for handling the protests.",
      "rx_thm": "The focus is on planned and organized actions to resolve the crisis."
    },
    {
      "rownum": 1860,
      "kw": "SURABAYA COMMUNITY CLEANUP",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "Online taxi drivers and residents collectively engaged in clearing debris after riots.",
      "rx_thm": "The focus is on community-led efforts to restore order and cleanliness after unrest."
    },
    {
      "rownum": 1861,
      "kw": "PRESIDENTIAL ORDER",
      "thm": "LAW AND ORDER",
      "rx_kw": "The President issued a direct command for strong measures against violent protests.",
      "rx_thm": "The directive emphasizes enforcing legal boundaries and maintaining public peace."
    },
    {
      "rownum": 1862,
      "kw": "PEKALONGAN DPRD BURNED",
      "thm": "ANARCHIC DESTRUCTION",
      "rx_kw": "The core event is the burning and damage of the DPRD building by anarchic demonstrators.",
      "rx_thm": "The protest involved uncontrolled and destructive acts against government property."
    },
    {
      "rownum": 1864,
      "kw": "SERANG POLICE POST FIRE",
      "thm": "REGIONAL UNREST",
      "rx_kw": "The summary details a police post catching fire during clashes in Serang.",
      "rx_thm": "The entry highlights public disorder and aggressive behavior in a specific region."
    },
    {
      "rownum": 1865,
      "kw": "JAKARTA RECOVERY",
      "thm": "PUBLIC SAFETY",
      "rx_kw": "The governor announced measures for city security and expressed condolences for protest casualties.",
      "rx_thm": "The focus is on restoring peace, ensuring public well-being, and addressing the aftermath of violence."
    },
    {
      "rownum": 1866,
      "kw": "POLICE CHIEF FIRM ACTION",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "The police chief announced a strong, coordinated response by security forces.",
      "rx_thm": "The primary goal is to re-establish peace and control after widespread unrest."
    },
    {
      "rownum": 1867,
      "kw": "JAKARTA UNITY APPEAL",
      "thm": "CIVIC RESPONSIBILITY",
      "rx_kw": "The governor appealed to residents to uphold peace and cohesion after the protests.",
      "rx_thm": "The message emphasizes the collective duty of citizens to maintain order and contribute to recovery."
    },
    {
      "rownum": 1869,
      "kw": "FREE PUBLIC TRANSPORT",
      "thm": "EMERGENCY RESPONSE",
      "rx_kw": "The provincial government offered free public transport as an immediate measure after riots.",
      "rx_thm": "The actions are urgent measures taken to address the immediate aftermath of widespread damage."
    },
    {
      "rownum": 1870,
      "kw": "GOVERNOR DIRECTIVES",
      "thm": "CRISIS MANAGEMENT",
      "rx_kw": "The governor received instructions on how to manage the ongoing protests and maintain order.",
      "rx_thm": "The focus is on the strategic handling and coordination of the response to the unrest."
    },
    {
      "rownum": 1871,
      "kw": "NATIONAL SECURITY MEETING",
      "thm": "GOVERNMENT COORDINATION",
      "rx_kw": "The President and top security leaders convened to discuss national stability.",
      "rx_thm": "The meeting highlights collaborative efforts among government branches to address the crisis."
    },
    {
      "rownum": 1873,
      "kw": "JAKARTA RIOT AFTERMATH",
      "thm": "PUBLIC SERVICE RECOVERY",
      "rx_kw": "The summary details the consequences of the riots and measures to restore services.",
      "rx_thm": "The focus is on bringing essential urban services back to normal after the unrest."
    },
    {
      "rownum": 1874,
      "kw": "ANARCHO GROUP ARRESTS",
      "thm": "POLICE RESPONSE",
      "rx_kw": "The police apprehended a large number of individuals from an anarchic group.",
      "rx_thm": "The entry describes law enforcement's actions to control and address violent protest elements."
    },
    {
      "rownum": 1876,
      "kw": "NORTH JAKARTA POLICE THREAT",
      "thm": "PUBLIC DISTURBANCE",
      "rx_kw": "A crowd is moving towards a police station, creating a potentially dangerous situation.",
      "rx_thm": "The situation involves public unrest and a potential threat to law enforcement facilities."
    },
    {
      "rownum": 1878,
      "kw": "SEMARANG MAYOR PRAYER",
      "thm": "CALL FOR PEACE",
      "rx_kw": "The mayor called for collective prayer to promote peace and safety in the city.",
      "rx_thm": "The appeal aims to foster calm and unity through spiritual means during a tense period."
    },
    {
      "rownum": 1879,
      "kw": "SURABAYA DETAINEE RELEASE",
      "thm": "MILITARY MEDIATION",
      "rx_kw": "The central demand of the protest is the release of arrested individuals.",
      "rx_thm": "The military intervened to facilitate communication and resolve the protest peacefully."
    },
    {
      "rownum": 1880,
      "kw": "BATAM EVENT CANCELED",
      "thm": "POLITICAL TENSION IMPACT",
      "rx_kw": "A public event was called off due to the sensitive national political climate.",
      "rx_thm": "The cancellation reflects the broader effect of political unrest on public life and events."
    },
    {
      "rownum": 1881,
      "kw": "SAHRONI HOUSE RAIDED",
      "thm": "PUBLIC ANGER",
      "rx_kw": "The core event is the attack and looting of a politician's house.",
      "rx_thm": "The incident is a direct manifestation of widespread public dissatisfaction and rage."
    },
    {
      "rownum": 1882,
      "kw": "PRESIDENT MEETS ISLAMIC LEADERS",
      "thm": "DE-ESCALATION EFFORTS",
      "rx_kw": "The President engaged with religious leaders to seek their help in calming the unrest.",
      "rx_thm": "The meeting is part of broader attempts to reduce tension and prevent further violence."
    },
    {
      "rownum": 1883,
      "kw": "PURWOKERTO PROTEST CHAOS",
      "thm": "REGIONAL VIOLENCE",
      "rx_kw": "The summary describes a protest in Purwokerto escalating into uncontrolled disorder and destruction.",
      "rx_thm": "The event highlights public disorder and aggressive behavior in a specific region."
    },
    {
      "rownum": 1884,
      "kw": "PURWODADI YOUTH RIOTS",
      "thm": "YOUTH UNREST",
      "rx_kw": "The core event involves young people engaging in violent and destructive protests.",
      "rx_thm": "The protests are characterized by the involvement of a younger demographic in destructive acts."
    },
    {
      "rownum": 1887,
      "kw": "DPR/MPR CLASHES",
      "thm": "ONGOING PROTESTS",
      "rx_kw": "The summary describes persistent confrontations near the parliamentary buildings.",
      "rx_thm": "The situation indicates continued public demonstrations and conflict over an extended period."
    },
    {
      "rownum": 1888,
      "kw": "YOGYAKARTA CLEANUP",
      "thm": "POST-PROTEST RECOVERY",
      "rx_kw": "The summary focuses on the efforts to clear debris and restore order after the riot.",
      "rx_thm": "The entry describes the process of restoring normalcy and repairing damage after civil disturbance."
    },
    {
      "rownum": 1890,
      "kw": "OFFICIALS ATTACKED",
      "thm": "DIRECT CONFRONTATION",
      "rx_kw": "Protesters directly assaulted high-ranking government and military officials.",
      "rx_thm": "The event involves a face-to-face, aggressive encounter between protesters and authorities."
    },
    {
      "rownum": 1891,
      "kw": "POLICING STRATEGY",
      "thm": "LAW ENFORCEMENT APPROACH",
      "rx_kw": "The entry discusses different methods and directives for handling protests.",
      "rx_thm": "The focus is on the methods and principles guiding security forces in managing public demonstrations."
    },
    {
      "rownum": 1892,
      "kw": "KWITANG BRIMOB CLASHES",
      "thm": "ONGOING VIOLENCE",
      "rx_kw": "The summary describes persistent violent confrontations near the Brimob headquarters.",
      "rx_thm": "The situation indicates a prolonged period of aggressive conflict and public disorder."
    },
    {
      "rownum": 1893,
      "kw": "KWITANG CLASH ESCALATION",
      "thm": "DOMESTIC TENSION IMPACT",
      "rx_kw": "The protests intensified into violent clashes near Brimob HQ, leading to significant consequences.",
      "rx_thm": "The escalating internal unrest is having a direct effect on national and international affairs."
    },
    {
      "rownum": 1894,
      "kw": "SAHRONI HOUSE LOOTED",
      "thm": "PUBLIC ANGER",
      "rx_kw": "The core event is the ransacking and theft at a politician's residence.",
      "rx_thm": "The incident is a direct manifestation of widespread public dissatisfaction and rage."
    },
    {
      "rownum": 1895,
      "kw": "PRESIDENT CANCELS VISIT",
      "thm": "DOMESTIC UNREST IMPACT",
      "rx_kw": "The President's decision to cancel international travel is directly linked to internal unrest.",
      "rx_thm": "The widespread protests are significantly affecting the President's international agenda."
    },
    {
      "rownum": 1896,
      "kw": "NORTH JAKARTA POLICE ATTACKED",
      "thm": "MOB VIOLENCE",
      "rx_kw": "The summary details the attack and burning of police facilities by a mob.",
      "rx_thm": "The destruction is caused by a large, uncontrolled group acting violently."
    },
    {
      "rownum": 1897,
      "kw": "SAHRONI HOUSE LOOTED",
      "thm": "TARGETED MOB VIOLENCE",
      "rx_kw": "The core event is the ransacking and theft at a politician's residence by a mob.",
      "rx_thm": "The violence is specifically directed at the property of a political figure."
    },
    {
      "rownum": 1898,
      "kw": "MINISTER HOUSE LOOTED",
      "thm": "TARGETED LOOTING",
      "rx_kw": "The core event is the ransacking and theft at a minister's residence.",
      "rx_thm": "The incident involves the systematic theft of items from a specific target during unrest."
    },
    {
      "rownum": 1899,
      "kw": "UYA KUYA HOUSE RAIDED",
      "thm": "TARGETED ATTACK",
      "rx_kw": "The core event is the forced entry and damage to a politician's house.",
      "rx_thm": "The incident involves a specific individual's property being deliberately targeted."
    }
  ],
  "2025-08-31": [
    {
      "rownum": 1902,
      "kw": "ARSON AND LOOTING",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary explicitly mentions \"arson and looting\" as key destructive acts during protests.",
      "rx_thm": "The entry describes destructive acts like arson and looting occurring during protests, indicating a violent aspect."
    },
    {
      "rownum": 1904,
      "kw": "DEFIANT PROTEST",
      "thm": "PUBLIC DISSENT",
      "rx_kw": "The summary highlights protesters' \"defiant\" actions despite heavy security and media blockage.",
      "rx_thm": "The entry describes a public demonstration where people express opposition despite government efforts to suppress it."
    },
    {
      "rownum": 1906,
      "kw": "WIDESPREAD RIOTS",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary explicitly states \"widespread riots, arson, and looting\" as the outcome of escalating protests.",
      "rx_thm": "The entry details protests escalating into destructive acts like riots, arson, and looting, indicating violence."
    },
    {
      "rownum": 1907,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo's directive for \"firm action\" against anarchic protesters is the central point of the summary.",
      "rx_thm": "The entry focuses on the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1910,
      "kw": "STUDENT PROTESTS",
      "thm": "PUBLIC DISSENT",
      "rx_kw": "The summary specifically mentions \"students\" as key participants in the protests and arrests.",
      "rx_thm": "The entry describes a public demonstration, specifically involving students, expressing opposition to policies."
    },
    {
      "rownum": 1914,
      "kw": "HOUSE LOOTING",
      "thm": "PROPERTY CRIME",
      "rx_kw": "The core event described is the \"looting\" of the Finance Minister's house.",
      "rx_thm": "The entry details a criminal act involving the theft of property from a private residence."
    },
    {
      "rownum": 1915,
      "kw": "POLICE HQ ATTACK",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The central event is the \"attack\" on the Police Headquarters by a mob.",
      "rx_thm": "The entry describes a violent confrontation where a mob attacked a government facility, leading to damage."
    },
    {
      "rownum": 1918,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The summary focuses on the \"firm, measured action\" ordered by the Police Chief against rioters.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of violent protests."
    },
    {
      "rownum": 1919,
      "kw": "ORDER RESTORED",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary emphasizes that \"order\" was \"restored\" after the mob attack.",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 1920,
      "kw": "HOUSE LOOTING",
      "thm": "PROPERTY CRIME",
      "rx_kw": "The core event described is the \"looting\" of the Finance Minister's house.",
      "rx_thm": "The entry details a criminal act involving the theft of property from a private residence."
    },
    {
      "rownum": 1921,
      "kw": "POLICE STATION ATTACK",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary describes an \"attack\" on a police station by a mob.",
      "rx_thm": "The entry details a violent confrontation where a mob attacked a government facility."
    },
    {
      "rownum": 1922,
      "kw": "POST-LOOTING SECURITY",
      "thm": "SECURITY MEASURES",
      "rx_kw": "The summary focuses on the \"heavily guarded\" status of the house \"after being looted.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order after an incident."
    },
    {
      "rownum": 1924,
      "kw": "COMMUNITY DEFENSE",
      "thm": "PUBLIC SAFETY",
      "rx_kw": "The summary highlights the \"community\" and an organization repelling the attackers.",
      "rx_thm": "The entry describes collective efforts by citizens to protect public order and safety."
    },
    {
      "rownum": 1925,
      "kw": "PUBLIC ORDER RESTORED",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary explicitly states \"public order restored\" after traffic disruption.",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 1926,
      "kw": "CALL FOR CALM",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The TNI Chief \"urged public calm, unity, dialogue, and adherence to law.\"",
      "rx_thm": "The entry details the government's official statements and efforts to manage public sentiment and maintain order."
    },
    {
      "rownum": 1927,
      "kw": "HOUSE LOOTING",
      "thm": "PROPERTY CRIME",
      "rx_kw": "The core event described is the \"looting\" of a DPR member's house.",
      "rx_thm": "The entry details a criminal act involving the theft of property from a private residence."
    },
    {
      "rownum": 1931,
      "kw": "PREVENT PANIC BUYING",
      "thm": "ECONOMIC STABILITY",
      "rx_kw": "The summary highlights the urgency to \"prevent panic buying\" and its economic implications.",
      "rx_thm": "The entry discusses measures and concerns related to maintaining economic order and public confidence."
    },
    {
      "rownum": 1933,
      "kw": "COORDINATED LOOTING",
      "thm": "PROPERTY CRIME",
      "rx_kw": "The summary emphasizes the \"coordinated waves\" of looting at the minister's house.",
      "rx_thm": "The entry details a criminal act involving the theft of property from a private residence."
    },
    {
      "rownum": 1936,
      "kw": "PUBLIC COMPOSURE",
      "thm": "PUBLIC SENTIMENT",
      "rx_kw": "The key message is urging the public to \"maintain composure\" amidst unrest.",
      "rx_thm": "The entry focuses on the emotional state and general mood of the populace during a period of unrest."
    },
    {
      "rownum": 1938,
      "kw": "FOREIGN MEDIA COVERAGE",
      "thm": "INTERNATIONAL PERCEPTION",
      "rx_kw": "The summary explicitly mentions \"foreign media extensively covered\" the events.",
      "rx_thm": "The entry discusses how national events are viewed and reported by international entities."
    },
    {
      "rownum": 1940,
      "kw": "POLICE VIOLENCE",
      "thm": "HUMAN RIGHTS",
      "rx_kw": "Komnas Perempuan \"condemns authorities' violent actions\" and \"police violence.\"",
      "rx_thm": "The entry focuses on the protection and violation of fundamental human rights during protests."
    },
    {
      "rownum": 1941,
      "kw": "FACILITY REPAIRS",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary focuses on \"repairs of facilities damaged by recent demonstrations.\"",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 1943,
      "kw": "POST-PROTEST CLEANUP",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary explicitly mentions a \"cleanup\" effort after an anarchic demonstration.",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 1947,
      "kw": "COALITION MEETING",
      "thm": "POLITICAL CONSULTATION",
      "rx_kw": "The summary describes President Prabowo \"summoned government coalition party chairpersons\" for a meeting.",
      "rx_thm": "The entry focuses on discussions and consultations among political leaders to address national issues."
    },
    {
      "rownum": 1951,
      "kw": "DPR ALLOWANCES",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "The central topic of discussion is \"public dissatisfaction over DPR allowances.\"",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances."
    },
    {
      "rownum": 1953,
      "kw": "HOUSE CONDITION",
      "thm": "PROPERTY SECURITY",
      "rx_kw": "The summary refers to news detailing the \"condition\" of the Finance Minister's house after incidents.",
      "rx_thm": "The entry provides an update on the safety and state of a property after an incident."
    },
    {
      "rownum": 1957,
      "kw": "PROTESTS TURN RIOTS",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary explicitly states \"demonstrations... turned into riots,\" causing damage.",
      "rx_thm": "The entry describes protests escalating into destructive acts, indicating violence and property damage."
    },
    {
      "rownum": 1958,
      "kw": "RP1 FARE",
      "thm": "PUBLIC TRANSPORT RECOVERY",
      "rx_kw": "Transjakarta is implementing a \"Rp1 fare\" as a response to service disruptions.",
      "rx_thm": "The entry describes measures taken to restore and support public transportation services after disruptions."
    },
    {
      "rownum": 1960,
      "kw": "COMMUNITY CLEANUP",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary highlights \"online motorcycle taxi drivers and Surabaya residents spontaneously cleaned\" damaged posts.",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts, especially by the community."
    },
    {
      "rownum": 1961,
      "kw": "BUILDING SET ABLAZE",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary explicitly states \"thousands stormed and set fire to the Jepara DPRD building.\"",
      "rx_thm": "The entry describes protests escalating into destructive acts, indicating violence and property damage."
    },
    {
      "rownum": 1967,
      "kw": "VISIT CANCELED",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"canceled his China visit\" due to escalating national protests.",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances, including changes in presidential schedule."
    },
    {
      "rownum": 1968,
      "kw": "MPS DEACTIVATED",
      "thm": "POLITICAL ACCOUNTABILITY",
      "rx_kw": "PAN \"deactivated Eko Patrio and Uya Kuya as MPs\" due to public anger.",
      "rx_thm": "The entry describes actions taken by political parties or government bodies to hold officials responsible for their actions."
    },
    {
      "rownum": 1969,
      "kw": "HOUSE LOOTING",
      "thm": "PROPERTY CRIME",
      "rx_kw": "The summary describes the \"looting and vandalism\" of a DPR member's house.",
      "rx_thm": "The entry details a criminal act involving the theft of property from a private residence."
    },
    {
      "rownum": 1970,
      "kw": "DPR ALLOWANCES REVOKED",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo announced \"DPR leaders would revoke member allowances.\"",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances."
    },
    {
      "rownum": 1971,
      "kw": "SUMMIT POSTPONED",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"postponed his SCO Summit visit\" due to domestic unrest.",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances, including changes in presidential schedule."
    },
    {
      "rownum": 1972,
      "kw": "TNI DENIES CLAIMS",
      "thm": "NATIONAL SECURITY",
      "rx_kw": "The TNI \"denies social media claims\" of its members provoking protests.",
      "rx_thm": "The entry focuses on the actions and statements of national security forces to maintain stability and counter misinformation."
    },
    {
      "rownum": 1973,
      "kw": "ANARCHIC ACTS",
      "thm": "GOVERNMENT STANCE",
      "rx_kw": "President Prabowo condemns \"anarchic acts, property damage, fatalities, and looting.\"",
      "rx_thm": "The entry details the government's official position and principles regarding public demonstrations and law enforcement."
    },
    {
      "rownum": 1974,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"ordered TNI and Police to take firm action\" against destruction and looting.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1975,
      "kw": "NATIONAL ADDRESS",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Jokowi \"addressed the nation\" on various issues related to unrest.",
      "rx_thm": "The entry details the government's official statements and actions in response to public grievances."
    },
    {
      "rownum": 1976,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"instructed police and TNI to take firm action\" against anarchic acts.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1977,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"ordered the Police and TNI to act decisively\" against rioters and looters.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1979,
      "kw": "DPR REFORMS",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo and party leaders \"agreed on DPR reforms\" in response to protests.",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances."
    },
    {
      "rownum": 1980,
      "kw": "HOUSE LOOTING",
      "thm": "PROPERTY CRIME",
      "rx_kw": "The summary describes the \"looting\" of the Finance Minister's house.",
      "rx_thm": "The entry details a criminal act involving the theft of property from a private residence."
    },
    {
      "rownum": 1981,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"ordered police and military to act firmly\" against illegal acts.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1982,
      "kw": "BRIMOB INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "President Prabowo \"demands a swift, transparent investigation into seven Brimob members.\"",
      "rx_thm": "The entry focuses on holding law enforcement officials responsible for their actions and ensuring transparency."
    },
    {
      "rownum": 1983,
      "kw": "BUS STOP ARSON",
      "thm": "INFRASTRUCTURE DAMAGE",
      "rx_kw": "The summary discusses the \"Transjakarta bus stop arson\" and public reaction.",
      "rx_thm": "The entry focuses on the destruction of public infrastructure during unrest."
    },
    {
      "rownum": 1984,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"ordered security forces to take firm action\" against anarchic acts.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1985,
      "kw": "DPR ALLOWANCES ABOLISHED",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"announced the abolition of DPR RI allowances.\"",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances."
    },
    {
      "rownum": 1986,
      "kw": "SECURITY PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Kapolda Metro Jaya \"announced large-scale security patrols\" to ensure public safety.",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 1987,
      "kw": "AREA NORMALIZED",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "The summary states the area \"returned to normal after unrest.\"",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 1988,
      "kw": "AFFAN INVESTIGATION",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "Kapolri \"orders a swift investigation into Affan Kurniawan's death.\"",
      "rx_thm": "The entry focuses on holding law enforcement officials responsible for their actions and ensuring transparency."
    },
    {
      "rownum": 1989,
      "kw": "NATIONAL UNITY",
      "thm": "GOVERNMENT STANCE",
      "rx_kw": "President Prabowo \"urges calm and national unity\" amidst demonstrations.",
      "rx_thm": "The entry details the government's official position and principles regarding public demonstrations and law enforcement."
    },
    {
      "rownum": 1990,
      "kw": "SECURITY PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polda Metro Jaya \"launched large-scale patrols\" to secure the city.",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 1991,
      "kw": "ITEMS RETURNED",
      "thm": "PUBLIC ETHICS",
      "rx_kw": "Two youths \"returned items found near Finance Minister Sri Mulyani's house.\"",
      "rx_thm": "The entry highlights moral behavior and honesty among the public during a period of unrest."
    },
    {
      "rownum": 1992,
      "kw": "LOOTING ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Police \"arrested nine individuals for looting Uya Kuya's house.\"",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 1993,
      "kw": "SECURITY DEPLOYMENT",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polda Papua \"deployed thousands of personnel to secure a peaceful demonstration.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 1995,
      "kw": "DPR DIALOGUE",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"urged DPR leaders to engage in direct dialogue with demonstrator groups.\"",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances."
    },
    {
      "rownum": 1996,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"ordered police and military to take firm action\" against anarchic acts.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 1998,
      "kw": "RESIGNATION RUMORS DENIED",
      "thm": "GOVERNMENT CLARIFICATION",
      "rx_kw": "Minister Airlangga Hartarto \"denied rumors of Finance Minister Sri Mulyani's resignation.\"",
      "rx_thm": "The entry focuses on official statements made to correct misinformation or clarify the status of government officials."
    },
    {
      "rownum": 2000,
      "kw": "REMOTE LEARNING",
      "thm": "EDUCATION IMPACT",
      "rx_kw": "UI \"shifts to remote learning due to prevailing unrest.\"",
      "rx_thm": "The entry focuses on the effects of national unrest on the education sector."
    },
    {
      "rownum": 2001,
      "kw": "VIOLENT DEMONSTRATIONS",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "The summary describes \"violent demonstrations\" causing significant damage.",
      "rx_thm": "The entry describes protests escalating into destructive acts, indicating violence and property damage."
    },
    {
      "rownum": 2003,
      "kw": "POLICE REFORM",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "GPIB called for \"responsive policies, humane security forces, police reform.\"",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2005,
      "kw": "ANTI-ANARCHY",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "Bandung officials \"declared 'anti-anarchy'\" and increased vigilance.",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2010,
      "kw": "FIRMLY CRACK DOWN",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"instructed TNI and Polri to firmly crack down on anarchic crowds.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2011,
      "kw": "LOOTING ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "\"Nine individuals were arrested for looting politician Uya Kuya's house.\"",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 2012,
      "kw": "RIOT SUSPECTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Polda Jateng \"named seven suspects\" in a Semarang riot.",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 2013,
      "kw": "LOOTING ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Police \"arrested seven individuals for looting politician Uya Kuya's house.\"",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 2014,
      "kw": "RIOT CONTROL DIRECTIVES",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "Kapolri confirms \"directives for firmly addressing rioters align with SOPs and legal framework.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement."
    },
    {
      "rownum": 2016,
      "kw": "BUILDING FIRE",
      "thm": "POST-UNREST INCIDENT",
      "rx_kw": "The summary describes a \"fire at the former Central Jakarta Metro Police building.\"",
      "rx_thm": "The entry details an event occurring in the aftermath of broader unrest, potentially related to it."
    },
    {
      "rownum": 2017,
      "kw": "RUBBER BULLETS ORDERED",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "Kapolri \"ordered police to use rubber bullets against rioters.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement, specifically regarding crowd control."
    },
    {
      "rownum": 2018,
      "kw": "NATIONAL STABILITY DIRECTIVES",
      "thm": "GOVERNMENT STRATEGY",
      "rx_kw": "The summary details President Prabowo's \"directives to TNI, Polri, and BIN for national stability.\"",
      "rx_thm": "The entry outlines a broad plan or approach by the government to address a complex national issue."
    },
    {
      "rownum": 2019,
      "kw": "INTER-FAITH APPEAL",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "An \"Inter-faith Youth Organization offers condolences\" and makes appeals.",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2020,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"instructs TNI and Polri to take firm action\" against legal violations.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2021,
      "kw": "TREASON CLARIFICATION",
      "thm": "GOVERNMENT CLARIFICATION",
      "rx_kw": "Defense Minister \"clarifies President Prabowo's 'symptoms leading to treason' statement.\"",
      "rx_thm": "The entry focuses on official statements made to correct misinformation or clarify the meaning of previous remarks."
    },
    {
      "rownum": 2022,
      "kw": "UNITY CALL",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "Bogor Mayor \"convenes leaders to foster unity and maintain a conducive environment.\"",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2023,
      "kw": "AMNESTY CRITICISM",
      "thm": "HUMAN RIGHTS ADVOCACY",
      "rx_kw": "\"Amnesty International criticizes President Prabowo's 'treason/terrorism' statements.\"",
      "rx_thm": "The entry highlights calls from international non-governmental organizations for human rights protection and accountability."
    },
    {
      "rownum": 2025,
      "kw": "GOVERNANCE DIRECTIVES",
      "thm": "GOVERNMENT STRATEGY",
      "rx_kw": "President Prabowo \"assigns tasks to ministers and institutions\" for post-protest governance.",
      "rx_thm": "The entry outlines a broad plan or approach by the government to address a complex national issue."
    },
    {
      "rownum": 2027,
      "kw": "STREETS REOPEN",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "\"Streets around Kwitang Brimob Headquarters... reopen for traffic.\"",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 2028,
      "kw": "REGIONAL SECURITY",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "Kapolda Banten, Governor, and religious leaders pray for \"Banten's security.\"",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2030,
      "kw": "INTER-FAITH APPEAL",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "\"Inter-faith youth expressed sympathy\" and called for various actions.",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2031,
      "kw": "CABINET MEETING",
      "thm": "POLITICAL CONSULTATION",
      "rx_kw": "Deputy Finance Ministers and leaders \"headed to the Presidential Palace for a cabinet meeting.\"",
      "rx_thm": "The entry focuses on discussions and consultations among political leaders to address national issues."
    },
    {
      "rownum": 2032,
      "kw": "STUDENT ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Central Java police \"arrested hundreds of junior/senior high students\" for anarchic demonstrations.",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 2034,
      "kw": "FIRE INVESTIGATION",
      "thm": "POST-UNREST INCIDENT",
      "rx_kw": "The summary mentions a \"fire at the former Central Jakarta Metro Police building, now under investigation.\"",
      "rx_thm": "The entry details an event occurring in the aftermath of broader unrest, potentially related to it."
    },
    {
      "rownum": 2035,
      "kw": "PLEA FOR PEACE",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "South Sulawesi Governor \"urges calm, order, peace, and dignified expression of opinions.\"",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2036,
      "kw": "FIRM LEGAL ACTION",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "National Police Chief \"warns of firm legal action against masses breaching Brimob HQ.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement."
    },
    {
      "rownum": 2037,
      "kw": "ISLAMIC LEADERS MEETING",
      "thm": "POLITICAL CONSULTATION",
      "rx_kw": "President Prabowo \"met with Islamic organizations\" to discuss de-escalation.",
      "rx_thm": "The entry focuses on discussions and consultations among political leaders and civil society to address national issues."
    },
    {
      "rownum": 2039,
      "kw": "FIRM ACTION URGED",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "Peradah Sulsel \"urges police to act firmly against rioters and looters.\"",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2043,
      "kw": "GHAIB PRAYER",
      "thm": "COMMUNITY RESPONSE",
      "rx_kw": "Riau Governor and community \"held a ghaib prayer for Affan Kurniawan.\"",
      "rx_thm": "The entry describes how the community reacts to significant events, often involving collective mourning or support."
    },
    {
      "rownum": 2044,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"vowing firm action against anarchy.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2046,
      "kw": "ECONOMIC LOSSES",
      "thm": "ECONOMIC IMPACT",
      "rx_kw": "Economist Mohammad Faisal \"warns of significant losses from destructive protests.\"",
      "rx_thm": "The entry focuses on the financial and economic consequences of national events."
    },
    {
      "rownum": 2047,
      "kw": "CALL FOR CALM",
      "thm": "GOVERNMENT STANCE",
      "rx_kw": "President Prabowo \"urged public trust and calm amidst demonstrations.\"",
      "rx_thm": "The entry details the government's official position and principles regarding public demonstrations and law enforcement."
    },
    {
      "rownum": 2048,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"orders TNI/law enforcement to act decisively against riots, vandalism, and looting.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2049,
      "kw": "FIRM LEGAL ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"orders TNI/Polri to take firm legal action\" against anarchic acts.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2050,
      "kw": "CROWD CONTROL ORDER",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "National Police Chief \"addressed a viral video of him ordering police to shoot crowds.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement."
    },
    {
      "rownum": 2052,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"instructs security forces to act firmly but legally\" against anarchic actions.",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2054,
      "kw": "RUBBER BULLET USAGE",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "Polda Metro Jaya \"confirms adherence to SOPs regarding rubber bullet usage.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement, specifically regarding crowd control."
    },
    {
      "rownum": 2055,
      "kw": "POST-PROTEST CLEANUP",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "\"TNI and sanitation workers clean up Kwitang after violent protests.\"",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and cleanup efforts."
    },
    {
      "rownum": 2056,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"orders firm action against treason, terrorism, vandalism, and looting.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2058,
      "kw": "LOOTING INVESTIGATION",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Police \"are investigating the looting of DPR member Eko Patrio's South Jakarta home.\"",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 2059,
      "kw": "INCREASED TNI PRESENCE",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Unrest led to \"increased TNI presence with tactical vehicles.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2060,
      "kw": "NATIONWIDE PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Deputy National Police Chief \"led nationwide TNI-Polri patrols to restore security.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2062,
      "kw": "LARGE-SCALE PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polda Metro Jaya \"conducts large-scale patrols in Jakarta... to maintain security.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2064,
      "kw": "TNI DENIES HOAX",
      "thm": "COUNTER MISINFORMATION",
      "rx_kw": "Mabes TNI \"denied a viral post claiming a TNI soldier was arrested for provoking riots, calling it false.\"",
      "rx_thm": "The entry focuses on efforts to combat false information and maintain public trust."
    },
    {
      "rownum": 2065,
      "kw": "PROTECT JOGJA",
      "thm": "COMMUNITY INITIATIVE",
      "rx_kw": "Yogyakarta residents are promoting \"Let's protect Jogja together\" in response to protests.",
      "rx_thm": "The entry describes actions taken by local citizens to foster peace and safety in their area."
    },
    {
      "rownum": 2066,
      "kw": "APPEAL FOR CALM",
      "thm": "GOVERNMENT STANCE",
      "rx_kw": "President Prabowo \"urges citizens to remain calm, trust the government, and avoid provocation.\"",
      "rx_thm": "The entry details the government's official position and principles regarding public demonstrations and law enforcement."
    },
    {
      "rownum": 2067,
      "kw": "JOINT PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polri and TNI \"conduct large-scale patrols down to RT/RW level to ensure public safety.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2068,
      "kw": "JOINT SECURITY PATROL",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Jakarta Metropolitan Police \"launched a large-scale joint patrol with TNI and community leaders.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2069,
      "kw": "POLICE TRANSPARENCY",
      "thm": "POLICE ACCOUNTABILITY",
      "rx_kw": "President Prabowo \"ordered police transparency in investigating the death of online motorcycle taxi driver Affan.\"",
      "rx_thm": "The entry focuses on holding law enforcement officials responsible for their actions and ensuring transparency."
    },
    {
      "rownum": 2070,
      "kw": "JOINT PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polri and TNI \"conduct large-scale patrols down to RT/RW level to ensure public safety.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2072,
      "kw": "DIALOGUE CHANNELS",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"opens dialogue channels for public feedback.\"",
      "rx_thm": "The entry details the government's official actions and statements in response to public grievances."
    },
    {
      "rownum": 2073,
      "kw": "PROVOCATEUR ARRESTS",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Polres Bogor \"named four suspects... for provoking a Cikeas Brimob attack.\"",
      "rx_thm": "The entry focuses on the actions taken by law enforcement to apprehend and prosecute criminals."
    },
    {
      "rownum": 2074,
      "kw": "RESIGNATION RUMORS DENIED",
      "thm": "GOVERNMENT CLARIFICATION",
      "rx_kw": "Minister Airlangga Hartarto \"denied rumors of Finance Minister Sri Mulyani's resignation.\"",
      "rx_thm": "The entry focuses on official statements made to correct misinformation or clarify the status of government officials."
    },
    {
      "rownum": 2076,
      "kw": "PBNU URGES GOVERNMENT",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "PBNU \"urges the government to positively address public aspirations.\"",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2078,
      "kw": "PEACEFUL DEMONSTRATIONS",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "World Mosque Youth President \"urges peaceful, non-anarchic demonstrations.\"",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2079,
      "kw": "LARGE-SCALE PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polda Metro Jaya \"conducts large-scale patrols in Jakarta to ensure public safety.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2080,
      "kw": "DISTANCE LEARNING",
      "thm": "EDUCATION IMPACT",
      "rx_kw": "Demonstrations \"led schools to implement distance learning.\"",
      "rx_thm": "The entry focuses on the effects of national unrest on the education sector."
    },
    {
      "rownum": 2081,
      "kw": "RESIGNATION RUMORS DENIED",
      "thm": "GOVERNMENT CLARIFICATION",
      "rx_kw": "Coordinating Minister Airlangga Hartarto \"denied reports of Finance Minister Sri Mulyani resigning.\"",
      "rx_thm": "The entry focuses on official statements made to correct misinformation or clarify the status of government officials."
    },
    {
      "rownum": 2082,
      "kw": "RIOT CONTROL READINESS",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "Kapolda Metro Jaya \"affirmed readiness to implement presidential directives for handling riots.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement."
    },
    {
      "rownum": 2083,
      "kw": "MUHAMMADIYAH URGES RESTRAINT",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "Muhammadiyah \"urged all parties... to exercise restraint after recent demonstrations.\"",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2085,
      "kw": "LARGE-SCALE PATROLS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Polda Metro Jaya \"deploys hundreds of personnel for large-scale patrols in Jakarta.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2086,
      "kw": "PUBLIC CALM URGED",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Kapolda Metro Jaya \"urged public calm and assured police protection.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2087,
      "kw": "NATIONAL SECURITY",
      "thm": "GOVERNMENT STRATEGY",
      "rx_kw": "President Prabowo \"instructed TNI/Polri to maintain national security.\"",
      "rx_thm": "The entry outlines a broad plan or approach by the government to address a complex national issue."
    },
    {
      "rownum": 2088,
      "kw": "ICMI URGES ACTION",
      "thm": "CIVIL SOCIETY ADVOCACY",
      "rx_kw": "ICMI \"urged President Prabowo to act swiftly on escalating tensions.\"",
      "rx_thm": "The entry highlights calls from non-governmental organizations or religious groups for policy changes and justice."
    },
    {
      "rownum": 2089,
      "kw": "RELIGIOUS LEADERS URGE PEACE",
      "thm": "COMMUNITY RESPONSE",
      "rx_kw": "\"Religious leaders in Tasikmalaya urged peace and peaceful expression.\"",
      "rx_thm": "The entry describes how the community reacts to significant events, often involving collective mourning or support."
    },
    {
      "rownum": 2091,
      "kw": "OJOL DRIVER INJURED",
      "thm": "CIVILIAN IMPACT",
      "rx_kw": "An \"ojol driver from Sukabumi was injured during Jakarta unrest.\"",
      "rx_thm": "The entry focuses on the effects of broader events on ordinary citizens."
    },
    {
      "rownum": 2092,
      "kw": "PUBLIC SERVICES UNDISRUPTED",
      "thm": "POST-UNREST RECOVERY",
      "rx_kw": "Central Java Governor \"assures public services are undisrupted after riots.\"",
      "rx_thm": "The entry describes the aftermath of an incident, focusing on the return to normalcy and continued functionality."
    },
    {
      "rownum": 2093,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"orders TNI/Polri to take firm action against riots, looting, and vandalism.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2094,
      "kw": "FIRM LEGAL ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"reiterated his order... to take firm, decisive legal action against rioters and looters.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2095,
      "kw": "NATIONAL UNREST RESPONSE",
      "thm": "GOVERNMENT STRATEGY",
      "rx_kw": "President Prabowo \"directs ministers and security forces to address national unrest.\"",
      "rx_thm": "The entry outlines a broad plan or approach by the government to address a complex national issue."
    },
    {
      "rownum": 2097,
      "kw": "FIRM ACTION",
      "thm": "GOVERNMENT RESPONSE",
      "rx_kw": "President Prabowo \"instructed Polri and TNI to act firmly against threats to national sovereignty.\"",
      "rx_thm": "The entry details the government's official directive and stance regarding the handling of protests."
    },
    {
      "rownum": 2098,
      "kw": "WASTE DEAL CANCELED",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "Pandeglang Regency Government \"canceled a waste management agreement... following protests.\"",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2099,
      "kw": "GOVERNANCE DIRECTIVES",
      "thm": "GOVERNMENT STRATEGY",
      "rx_kw": "President Prabowo \"tasked Minister Tito Karnavian with monitoring the economy and regional governance.\"",
      "rx_thm": "The entry outlines a broad plan or approach by the government to address a complex national issue."
    },
    {
      "rownum": 2100,
      "kw": "FLYOVER SECURED",
      "thm": "SECURITY MEASURES",
      "rx_kw": "The Summarecon Flyover in Bekasi \"was secured by TNI and marines after a night of public gathering.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2101,
      "kw": "SHOOTING CLAIMS DENIED",
      "thm": "GOVERNMENT CLARIFICATION",
      "rx_kw": "East Jakarta Metro Police \"deny viral claims of shooting civilians during unrest.\"",
      "rx_thm": "The entry focuses on official statements made to correct misinformation or clarify the status of government actions."
    },
    {
      "rownum": 2102,
      "kw": "PEACEFUL DEMONSTRATIONS",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "NTT Governor \"allows peaceful student demonstrations but warns against anarchy.\"",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2105,
      "kw": "JOINT PATROL",
      "thm": "SECURITY MEASURES",
      "rx_kw": "TNI, Polri, and Brebes Government \"conduct large-scale patrols after an anarchic demonstration.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2106,
      "kw": "STUDENTS RELEASED",
      "thm": "LAW ENFORCEMENT",
      "rx_kw": "Central Java Regional Police \"released 63 students arrested for anarchic demonstrations after guidance.\"",
      "rx_thm": "The entry focuses on the actions taken by law enforcement, including arrests and releases, in response to public unrest."
    },
    {
      "rownum": 2108,
      "kw": "STUDENT DEATH",
      "thm": "PROTEST FATALITY",
      "rx_kw": "The summary focuses on \"the death of Amikom Yogyakarta student Rheza Sendy Pratama during a protest.\"",
      "rx_thm": "The entry highlights a death occurring in the context of public demonstrations, raising concerns about safety and accountability."
    },
    {
      "rownum": 2110,
      "kw": "DPRD BUILDING DAMAGED",
      "thm": "PROTEST VIOLENCE",
      "rx_kw": "Tasikmalaya City \"DPRD building suffered extensive damage during mass protests.\"",
      "rx_thm": "The entry describes protests escalating into destructive acts, indicating violence and property damage."
    },
    {
      "rownum": 2111,
      "kw": "RUBBER BULLET USE",
      "thm": "LAW ENFORCEMENT POLICY",
      "rx_kw": "Polda Metro Jaya \"addresses rubber bullet use in Jakarta demos, affirming SOP adherence.\"",
      "rx_thm": "The entry focuses on the official guidelines and policies governing the actions of law enforcement, specifically regarding crowd control."
    },
    {
      "rownum": 2113,
      "kw": "TEAR GAS FIRED",
      "thm": "POLICE ACTION",
      "rx_kw": "Police \"firing tear gas at an unknown crowd near the Polres.\"",
      "rx_thm": "The entry describes specific actions taken by law enforcement during a public disturbance."
    },
    {
      "rownum": 2115,
      "kw": "PEACEFUL DEMONSTRATIONS",
      "thm": "LOCAL GOVERNANCE",
      "rx_kw": "NTT Governor \"urges peaceful, non-destructive demonstrations.\"",
      "rx_thm": "The entry focuses on the actions and statements of local authorities to maintain order and address public concerns."
    },
    {
      "rownum": 2116,
      "kw": "FIRM ACTION READINESS",
      "thm": "SECURITY MEASURES",
      "rx_kw": "Kapolda Metro Jaya \"confirms readiness for firm, measured action against anarchic acts.\"",
      "rx_thm": "The entry describes actions taken by authorities to protect property and maintain order."
    },
    {
      "rownum": 2121,
      "kw": "TREASON CLARIFICATION",
      "thm": "GOVERNMENT CLARIFICATION",
      "rx_kw": "Defense Minister \"clarifies President Prabowo's 'potential treason' statement.\"",
      "rx_thm": "The entry focuses on official statements made to correct misinformation or clarify the meaning of previous remarks."
    }
  ]
}